Zusammenfassung.org
#+TITLE: Zusammenfassung "Ubau
#+LATEX_HEADER: \usepackage{ngerman}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{tikz-qtree}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{matrix}





* Weg zum generischen Compiler

- kontextfreie Sprache \rightarrow Parser \rightarrow Termalgebra \rightarrow generische Faltung \rightarrow Algebra

* Algebraische Modellierung

** Grundlagen

Seien A, B Mengen, f: A \to B, C \subseteq A, D \subseteq B, n > 0.

- \emptyset: leere Menge
- 1: {\epsilon}
- 2: {0,1}
- [n]: {1,..,n}
- \Delta^{n}_{A} =_def {(a_1,..,a_n) \in A^n | \forall 1 \leq i < n: a_i = a_{i+1} }
- f(C) =_def {f(a) | a \in C} = P(f)(C) 
- img(f) =_def f(A)
- f^{-1}(D) =_def {a \in A | f(a) \in D}
- ker(f) =_def {(a,a') \in A \times A | f(a) = f(a')}
- graph(f) =_def {(a, f(a)) \in A \times B | a \in A}
- f|_C: C \to B = c \to f(c)
- f[b/a]: A \to B = c \to if c = a then b else f(c)
- \chi: P(A) \to 2^A = C \to \lambda a. if a \in C then 1 else 0
- f ist surjektiv \Leftrightarrow_def img(f) = B
- f ist injektiv \Leftrightarrow_def ker(f) = \Delta^{2}_{A}
- f ist bijektiv \Leftrightarrow_def \exists g: B \to A: g . f = id_A \and f . g = id_B
- A \cong B \Leftrightarrow_def \exists f: A \to B und f ist bijektiv

** Mehrsortige Mengen

- Sei S eine Menge. Ein Tuple A = (A_s)_{s\[ \in \]S} ist dann eine S-indizierte(sortige) Menge.
- Seien A = (A_s)_{s\[ \in \]S} und B = (B_s)_{s\[ \in\]S} S-sortige Mengen. f: A \to B ist eine S-sortige Menge (f_s)_{s\[ \in \]S}, so dass \forall s \in S. f_s:A_s \to B_s.
- Seien n > 0. Eine n-stellige S-sortige Relation auf A ist eine S-sortige Menge R = (R_s)_{s\[ \in \]S} mit R_s \subseteq A_{s}^{n} f"ur alle  s\in S. 
- Im Fall n = 1, hei"st R S-sortige Teilmenge von A genannt.
- kartesisches Produkt einer I-sortigen Menge: \times_{i\[ \in \]I}A_i = {f:I \to \cup_{i\[ \in\]I}A_i | \forall i\in I : f(i) \in A_i}
- Gibt es eine Menge A mit A_i = A f"ur alle i\in I, dann stimmt \times_{i\[ \in \]I}A_i offenbar mit A^I "uberein. Im Fall I = [n] f"ur ein n > 1 schreibt man auch A_1 \times ... \times A_n anstelle von \times_{i\[ \in \]I} A_i und A^n snatelle von A^I.
- disjunkte Vereinigung: \uplus_{i\[ \in \]I}A_i = \cup_{i\[ \in \]I}(A_i \times {i})
- Im Fall I = [n] f"ur ein n > 1 schreibt man auch A_1 + .. + A_n anstelle von \uplus_{i\[ \in \]I}A_i.
- A^{+} =_def \cup_{n>0}A^n
- 1 =_def {\epsilon}
- A^{*} =_def 1 \cup A^{+}
- \cdot: A^{*} \times A^{*} \to A^{*} und \cdot: P(A^{*}) \times P(A^{*}) \to P(A^{*}) ist die Konkatenationen von Strings

** Produkte und Summen als universelle Konstruktionen
   
Sei I eine nichtleere Menge und A eine I-sortige Menge.
Das kartesische Produkt und die disjunkte Vereinigung eines Mengentupels A haben bestimmte *universelle Eigenschaften*.
- Jede Menge mit den universellen Eigenschaften des kartesischen Produkts nennt man /Produkt von A/
- Jede Menge mit den universellen Eigenschaften der disjunkten Vereinigung nennt man /Summe von A/

*** Produkt
Sei A = (A_i)_{i\[ \in \]I} ein Mengentuple, P eine Menge und \pi = (\pi_i: P \to A_i)_{i\[ \in \]I} ein Funktionstuple.
Das Paar (P, \pi) hei"st *Produkt von A*, wenn es f"ur alle Tuple (f_i: B \to A_i)_{i\[ \in \]I} genau eine Funktion f: B \to P gibt derart,
dass f"ur alle i\in I Folgendes gilt:

#+BEGIN_CENTER
			\pi_i . f = f_i				   
#+END_CENTER 

\pi_i hei"st i-te Projektion von P und g Produktextension oder Range-Tuple von f. g wird mit \langle f_i \rangle_{i\[ \in \]I} und im Falle
von I = [n], n > 1, auch mit \langle f_1,..,f_n \rangle bezeichnet.

Demnach gilt:

#+BEGIN_CENTER
(\forall i\in I : \pi_i . f = \pi_i \bigcirc g) \Rightarrow f = g

#+END_CENTER

\times_{i\[ \in \]I}A_i ist ein Produkt von A.

Die Projektion und Produktextensionen f"ur \times_{i\[ \in \]I}A_i sind wie folgt definiert:
- F"ur alle i\in I und f\in \times_{i\[ \in \]I}A_i, \pi_i(f) =_def f(i)
- F"ur alle (f_i: B \to A_i)_{i\[ \in \]I}, b\in B und i \in I, \langle f_i \rangle_{i\[ \in \]I}(b)(i) =_def f_i(b).

**** Satz 2.2 Produkte sind /bis auf Isomorphie/ eindeutig:
- Seien (P, \pi) und (P', \pi') Produkte von A. Dann sind P und P' isomorph.
- Seien (P, \pi) ein Produkt von A, P' eine Menge und h: P' \to P eine bijektive Abbildung. Dann ist (P', \pi') mit \pi' = (\pi . h)_{i\[ \in \]I} ebenfalls ein Produkt von A.


Die Funktion 
#+BEGIN_CENTER
\Pi_{i\[ \in \]I}f_i =_def \langle f_i . \pi_i \rangle : P \to P'  
#+END_CENTER
hei"st *Produkt von f*.

F"ur alle nichtleeren Mengen I,f: A \to B und n > 0,

#+BEGIN_CENTER
f^I =_def \Pi_{i\[ \in \]I} f_i,  \\
f_1 \times .. \times f_n =_def \Pi_{i\[ \in \][n]} f_i.
#+END_CENTER

F"ur alle f: A \to B, (f_i: B \to B_i)_{i\[ \in \]I}, (g_i: A_i \to B_i)_{i\[ \in \]I}, k\in I und (h_i: B_i \to A_i)_{i\[ \in \]I},
#+BEGIN_CENTER
\langle f_i \rangle_{i\[ \in \]I} . f = \langle f_i . f \rangle_{i\[ \in \]I}, \\
\pi_k . \Pi_{i\[ \in \]I}g_i = g_k \pi_k, \\
(\Pi_{i\[ \in \]I}h_i) . \langle f_i \rangle_{i\[ \in \]I} = \langle h_i . f_i \rangle_{i\[ \in \]I}. \\
#+END_CENTER

*** Summe 

Vom Produkt kommt man zur Summe, indem man alle Funktionspfeile umdreht:
Sei A = (A_i)_{i\[ \in \]I} ein Mengentuple, S eine Menge und \iota = (\iota_i: A_i \to S)_{i\[ \in \]I} ein Funktionstuple.
Das Paar (S, \iota) hei"st *Summe* oder *Coprodukt von A*, wenn es f"ur alle Tuple (f_i: A_i \to B)_{i\[ \in \]I} _genau_ eine Funktion
f: S \to B gibt mit 
#+BEGIN_CENTER
f . \iota_i = f_i
#+END_CENTER
f"ur alle i \in I. \\ 

\iota_i hei"st i-te Injektion von S und g Summenextension oder Domain Tuplung von f. g wird mit [f_i]_{i\[ \in \]I} und im Falle I = [n],
n>1, auch mit [f_1,..,f_n] bezeichnet. 

Demnach gilt:


#+BEGIN_CENTER
(\forall i\in I : f . \iota_i = g . \iota_i) \Rightarrow f = g
#+END_CENTER

