Zusammenfassung.tex
% Created 2017-09-08 Fri 07:30
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{ngerman}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{tikz-qtree}
\usepackage{tikz}
\usetikzlibrary{matrix}
\author{Richard Stewing}
\date{\today}
\title{Zusammenfassung "Ubau}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents






\section{Weg zum generischen Compiler}
\label{sec-1}

\begin{itemize}
\item kontextfreie Sprache $\rightarrow$ Parser $\rightarrow$ Termalgebra $\rightarrow$ generische Faltung $\rightarrow$ Algebra
\end{itemize}

\section{Algebraische Modellierung}
\label{sec-2}

\subsection{Grundlagen}
\label{sec-2-1}

Seien A, B Mengen, f: A $\to$ B, C \subseteq A, D \subseteq B, n > 0.

\begin{itemize}
\item $\emptyset$: leere Menge
\item 1: \{$\epsilon$\}
\item 2: \{0,1\}
\item\relax [n]: \{1,..,n\}
\item $\Delta$$^{\text{n}}_{\text{A}}$ =$_{\text{def}}$ \{(a$_{\text{1}}$,..,a$_{\text{n}}$) $\in$ A$^{\text{n}}$ | $\forall$ 1 $\le$ i < n: a$_{\text{i}}$ = a$_{\text{i+1}}$ \}
\item f(C) =$_{\text{def}}$ \{f(a) | a $\in$ C\} = P(f)(C)
\item img(f) =$_{\text{def}}$ f(A)
\item f$^{\text{-1}}$(D) =$_{\text{def}}$ \{a $\in$ A | f(a) $\in$ D\}
\item ker(f) =$_{\text{def}}$ \{(a,a') $\in$ A \texttimes{} A | f(a) = f(a')\}
\item graph(f) =$_{\text{def}}$ \{(a, f(a)) $\in$ A \texttimes{} B | a $\in$ A\}
\item f|$_{\text{C}}$: C $\to$ B = c $\to$ f(c)
\item f[b/a]: A $\to$ B = c $\to$ if c = a then b else f(c)
\item $\chi$: P(A) $\to$ 2$^{\text{A}}$ = C $\to$ $\lambda$ a. if a $\in$ C then 1 else 0
\item f ist surjektiv $\Leftrightarrow$$_{\text{def}}$ img(f) = B
\item f ist injektiv $\Leftrightarrow$$_{\text{def}}$ ker(f) = $\Delta$$^{\text{2}}_{\text{A}}$
\item f ist bijektiv $\Leftrightarrow$$_{\text{def}}$ $\exists$ g: B $\to$ A: g . f = id$_{\text{A}}$ \and f . g = id$_{\text{B}}$
\item A $\cong$ B $\Leftrightarrow$$_{\text{def}}$ $\exists$ f: A $\to$ B und f ist bijektiv
\end{itemize}

\subsection{Mehrsortige Mengen}
\label{sec-2-2}

\begin{itemize}
\item Sei S eine Menge. Ein Tuple A = (A$_{\text{s}}$)$_{\text{s} \in \text{S}}$ ist dann eine S-indizierte(sortige) Menge.
\item Seien A = (A$_{\text{s}}$)$_{\text{s} \in \text{S}}$ und B = (B$_{\text{s}}$)$_{\text{s} \in\text{S}}$ S-sortige Mengen. f: A $\to$ B ist eine S-sortige Menge (f$_{\text{s}}$)$_{\text{s} \in \text{S}}$, so dass $\forall$ s $\in$ S. f$_{\text{s}}$:A$_{\text{s}}$ $\to$ B$_{\text{s}}$.
\item Seien n > 0. Eine n-stellige S-sortige Relation auf A ist eine S-sortige Menge R = (R$_{\text{s}}$)$_{\text{s} \in \text{S}}$ mit R$_{\text{s}}$ \subseteq A$_{\text{s}}^{\text{n}}$ f"ur alle  s$\in$ S.
\item Im Fall n = 1, hei"st R S-sortige Teilmenge von A genannt.
\item kartesisches Produkt einer I-sortigen Menge: \texttimes{}$_{\text{i} \in \text{I}}$A$_{\text{i}}$ = \{f:I $\to$ $\cup$$_{\text{i} \in\text{I}}$A$_{\text{i}}$ | $\forall$ i$\in$ I : f(i) $\in$ A$_{\text{i}}$\}
\item Gibt es eine Menge A mit A$_{\text{i}}$ = A f"ur alle i$\in$ I, dann stimmt \texttimes{}$_{\text{i} \in \text{I}}$A$_{\text{i}}$ offenbar mit A$^{\text{I}}$ "uberein. Im Fall I = [n] f"ur ein n > 1 schreibt man auch A$_{\text{1}}$ \texttimes{} \ldots{} \texttimes{} A$_{\text{n}}$ anstelle von \texttimes{}$_{\text{i} \in \text{I}}$ A$_{\text{i}}$ und A$^{\text{n}}$ snatelle von A$^{\text{I}}$.
\item disjunkte Vereinigung: \uplus$_{\text{i} \in \text{I}}$A$_{\text{i}}$ = $\cup$$_{\text{i} \in \text{I}}$(A$_{\text{i}}$ \texttimes{} \{i\})
\item Im Fall I = [n] f"ur ein n > 1 schreibt man auch A$_{\text{1}}$ + .. + A$_{\text{n}}$ anstelle von \uplus$_{\text{i} \in \text{I}}$A$_{\text{i}}$.
\item A$^{\text{+}}$ =$_{\text{def}}$ $\cup$$_{\text{n>0}}$A$^{\text{n}}$
\item 1 =$_{\text{def}}$ \{$\epsilon$\}
\item A$^{\text{*}}$ =$_{\text{def}}$ 1 $\cup$ A$^{\text{+}}$
\item $\cdot$: A$^{\text{*}}$ \texttimes{} A$^{\text{*}}$ $\to$ A$^{\text{*}}$ und $\cdot$: P(A$^{\text{*}}$) \texttimes{} P(A$^{\text{*}}$) $\to$ P(A$^{\text{*}}$) ist die Konkatenationen von Strings
\end{itemize}

\subsection{Produkte und Summen als universelle Konstruktionen}
\label{sec-2-3}

Sei I eine nichtleere Menge und A eine I-sortige Menge.
Das kartesische Produkt und die disjunkte Vereinigung eines Mengentupels A haben bestimmte \textbf{universelle Eigenschaften}.
\begin{itemize}
\item Jede Menge mit den universellen Eigenschaften des kartesischen Produkts nennt man \emph{Produkt von A}
\item Jede Menge mit den universellen Eigenschaften der disjunkten Vereinigung nennt man \emph{Summe von A}
\end{itemize}

\subsubsection{Produkt}
\label{sec-2-3-1}
Sei A = (A$_{\text{i}}$)$_{\text{i} \in \text{I}}$ ein Mengentuple, P eine Menge und $\pi$ = ($\pi$$_{\text{i}}$: P $\to$ A$_{\text{i}}$)$_{\text{i} \in \text{I}}$ ein Funktionstuple.
Das Paar (P, $\pi$) hei"st \textbf{Produkt von A}, wenn es f"ur alle Tuple (f$_{\text{i}}$: B $\to$ A$_{\text{i}}$)$_{\text{i} \in \text{I}}$ genau eine Funktion f: B $\to$ P gibt derart,
dass f"ur alle i$\in$ I Folgendes gilt:

\begin{center}
$\pi$$_{\text{i}}$ . f = f$_{\text{i}}$       
\end{center}

$\pi$$_{\text{i}}$ hei"st i-te Projektion von P und g Produktextension oder Range-Tuple von f. g wird mit \langle f$_{\text{i}}$ \rangle$_{\text{i} \in \text{I}}$ und im Falle
von I = [n], n > 1, auch mit \langle f$_{\text{1}}$,..,f$_{\text{n}}$ \rangle bezeichnet.

Demnach gilt:

\begin{center}
($\forall$ i$\in$ I : $\pi$$_{\text{i}}$ . f = $\pi$$_{\text{i}}$ \bigcirc g) $\Rightarrow$ f = g
\end{center}

\texttimes{}$_{\text{i} \in \text{I}}$A$_{\text{i}}$ ist ein Produkt von A.

Die Projektion und Produktextensionen f"ur \texttimes{}$_{\text{i} \in \text{I}}$A$_{\text{i}}$ sind wie folgt definiert:
\begin{itemize}
\item F"ur alle i$\in$ I und f$\in$ \texttimes{}$_{\text{i} \in \text{I}}$A$_{\text{i}}$, $\pi$$_{\text{i}}$(f) =$_{\text{def}}$ f(i)
\item F"ur alle (f$_{\text{i}}$: B $\to$ A$_{\text{i}}$)$_{\text{i} \in \text{I}}$, b$\in$ B und i $\in$ I, \langle f$_{\text{i}}$ \rangle$_{\text{i} \in \text{I}}$(b)(i) =$_{\text{def}}$ f$_{\text{i}}$(b).
\end{itemize}

\begin{enumerate}
\item Satz 2.2 Produkte sind \emph{bis auf Isomorphie} eindeutig:
\label{sec-2-3-1-1}
\begin{itemize}
\item Seien (P, $\pi$) und (P', $\pi$') Produkte von A. Dann sind P und P' isomorph.
\item Seien (P, $\pi$) ein Produkt von A, P' eine Menge und h: P' $\to$ P eine bijektive Abbildung. Dann ist (P', $\pi$') mit $\pi$' = ($\pi$ . h)$_{\text{i} \in \text{I}}$ ebenfalls ein Produkt von A.
\end{itemize}


Die Funktion 
\begin{center}
$\Pi$$_{\text{i} \in \text{I}}$f$_{\text{i}}$ =$_{\text{def}}$ \langle f$_{\text{i}}$ . $\pi$$_{\text{i}}$ \rangle : P $\to$ P'  
\end{center}
hei"st \textbf{Produkt von f}.

F"ur alle nichtleeren Mengen I,f: A $\to$ B und n > 0,

\begin{center}
f$^{\text{I}}$ =$_{\text{def}}$ $\Pi$$_{\text{i} \in \text{I}}$ f$_{\text{i}}$,  \\
f$_{\text{1}}$ \texttimes{} .. \texttimes{} f$_{\text{n}}$ =$_{\text{def}}$ $\Pi$$_{\text{i} \in \text{[n]}}$ f$_{\text{i}}$.
\end{center}

F"ur alle f: A $\to$ B, (f$_{\text{i}}$: B $\to$ B$_{\text{i}}$)$_{\text{i} \in \text{I}}$, (g$_{\text{i}}$: A$_{\text{i}}$ $\to$ B$_{\text{i}}$)$_{\text{i} \in \text{I}}$, k$\in$ I und (h$_{\text{i}}$: B$_{\text{i}}$ $\to$ A$_{\text{i}}$)$_{\text{i} \in \text{I}}$,
\begin{center}
\langle f$_{\text{i}}$ \rangle$_{\text{i} \in \text{I}}$ . f = \langle f$_{\text{i}}$ . f \rangle$_{\text{i} \in \text{I}}$, \\
$\pi$$_{\text{k}}$ . $\Pi$$_{\text{i} \in \text{I}}$g$_{\text{i}}$ = g$_{\text{k}}$ $\pi$$_{\text{k}}$, \\
($\Pi$$_{\text{i} \in \text{I}}$h$_{\text{i}}$) . \langle f$_{\text{i}}$ \rangle$_{\text{i} \in \text{I}}$ = \langle h$_{\text{i}}$ . f$_{\text{i}}$ \rangle$_{\text{i} \in \text{I}}$. \\
\end{center}
\end{enumerate}

\subsubsection{Summe}
\label{sec-2-3-2}

Vom Produkt kommt man zur Summe, indem man alle Funktionspfeile umdreht:
Sei A = (A$_{\text{i}}$)$_{\text{i} \in \text{I}}$ ein Mengentuple, S eine Menge und $\iota$ = ($\iota$$_{\text{i}}$: A$_{\text{i}}$ $\to$ S)$_{\text{i} \in \text{I}}$ ein Funktionstuple.
Das Paar (S, $\iota$) hei"st \textbf{Summe} oder \textbf{Coprodukt von A}, wenn es f"ur alle Tuple (f$_{\text{i}}$: A$_{\text{i}}$ $\to$ B)$_{\text{i} \in \text{I}}$ \uline{genau} eine Funktion
f: S $\to$ B gibt mit 
\begin{center}
f . $\iota$$_{\text{i}}$ = f$_{\text{i}}$
\end{center}
f"ur alle i $\in$ I. \\

$\iota$$_{\text{i}}$ hei"st i-te Injektion von S und g Summenextension oder Domain Tuplung von f. g wird mit [f$_{\text{i]}}$$_{\text{i} \in \text{I}}$ und im Falle I = [n],
n>1, auch mit [f$_{\text{1}}$,..,f$_{\text{n]}}$ bezeichnet. 

Demnach gilt:


\begin{center}
($\forall$ i$\in$ I : f . $\iota$$_{\text{i}}$ = g . $\iota$$_{\text{i}}$) $\Rightarrow$ f = g
\end{center}

\begin{enumerate}
