Zusammenfassung.org
**** Satz 2.3 Summen sind /bis auf Isomorphie/ eindeutig:
- Seien (S, \iota) und (S', \iota') Summen von A. Dann sind P und P' isomorph.
- Sei (S, \iota) eine Summe von A, S' eine Menge und h: S \to S' eine bijektive Abbildung. Dann ist (S', \iota') mit \iota' = (h . \iota_i)_{i\[ \in \]I} ebenfalls eine summe von A.

Sei (S, \iota) eine Summe von (A_i)_{i\[ \in \]I}, ein (S', \iota') eine Summe von (B_i)_{i\[ \in \]I} und f = (f_i: A_i \to B_i)_{i\[ \in \]I}
Die Funktion
#+BEGIN_CENTER
\amalg_{i\[ \in \]I}f_i =_def [\iota_{i}' . f_{i}]: S \to S' 
#+END_CENTER
hei"st Summe von f.


F"ur alle nichtleeren Mengen I,f: A \to B und n>0,
#+BEGIN_CENTER
f \times I =_def \amalg_{i\[ \in \]I} f, \\
f_1+..+f_n =_def \amalg_{i\[ \in \][n]} f_i, \\
f^{+} =_def \amalg_{n\[ \in \]\mathbb{N}} f^{[n]}, \\
f^{*} =_def 1 + f^{+} =_def id_1 + f^{+}. \\
#+END_CENTER

** Typen und Signaturen

Sei S eine Menge von - *Sorten* genannten - Symbolen.
Die Klasse T_p(S) der *polynomialen Typen "uber* S:
- S \subseteq T_p(S)
- Jede nichtleere Menge ist ein polynomialer Typ
- F"ur alle nichtleeren Mengen I und (e_i)_{i\in I}\in T_p(S)^I, \Pi_{i\in I} e_i, \amalg_{i\in I}e_i \in T_p(S) 


- Ein Typ der Form \Pi_{i\in I}e_i hei"st *I-stelliger Produkttyp* mit den *Faktoren* e_i, i\in I.
- Ein Typ der Form \amalg_{i\in I}e_i hei"st *I-stelliger Summentyp* mit den *Summanden* e_i, i\in I.

F"ur alle n>0, e_1,..,e_n, e\in T_p(S) und nichtleere Mengen I,
#+BEGIN_CENTER
e_1 \times .. \times e_n =_def \Pi_{i\[ \in \][n]}e_i, \\
e_1 + .. + e_n =_def \amalg_{i\[ \in \][n]}e_i, \\
e^I =_def \Pi_{i\[ \in \]I}e_i, \\
e^n =_def e^[n], \\
e^{+} =_def \amalg_{n>0}e^n, \\
e^{*} =_def 1 + e^{+}. \\
#+END_CENTER

Eine S-sortige Menge A wird wie folgt zur T_p(S)-sortigen Menge erweitert: F"ur alle nichtleeren Mengen I und (e_i)_{i\[ \in \]I}

#+BEGIN_CENTER
A_I = I, \\
A_{\Pi_{i\[ \in \]I}e_i} = \times_{i\[ \in \]I} A_{e_i}, \\
A_{\amalg_{i\[ \in \]I}e_i} = \uplus_{i\[ \in \]I} A_{e_i}.
#+END_CENTER

F"ur alle e \in T_p(S) und a \in A_e nennen wir e den Typen von a.

Eine S-sortige Funktion h: A \to B wird wie folgt zur T_p(S)-sortigen Menge f"ur alle nichtleeren Mengen I und (e_i)_{i \[ \in \]} 
\in T_p(S)^I.

#+BEGIN_CENTER
h_I = id_I, \\
h_{\Pi_{i \[ \in \]I}} = \Pi_{i\[ \in \]I}h_{e_i}, \\
h_{\amalg_{i \[ \in \]I}} = \amalg_{i\[ \in \]I}h_{e_i}.
#+END_CENTER


F"ur alle S-sortigen Mengen A, S-sortige Funktionen h: A \to B, n>0, nichtleeren Menge I und e_1,..e_n, e \in T_p(S) gilt Folgendes:
#+BEGIN_CENTER
A_{e_1 \times .. \times e_n} = A_{e_1} \times .. \times A_{e_n}, \\
A_{e_1 + .. + e_n} = A_{e_1} + .. + A_{e_n}, \\
A_{e^I} = A^I_e, \\
A_{e^n} = A^n_e, \\
A_{e^{+}} = A^{+}_e, \\
A_{e^{*}} = A^{*}_e, \\

h_{e_1 \times .. \times e_n} = h_{e_1} \times .. \times h_{e_n}, \\
h_{e_1 + .. + e_n} = h_{e_1} + .. + h_{e_n}, \\
h_{e^I} = h^I_e, \\
h_{e^n} = h^{[n]}_e, \\
h_{e^{+}} = h^{+}_e, \\
h_{e^{*}} = h^{*}_e.
#+END_CENTER



** Signaturen

- Eine *Signatur* \Sigma = (S, F) besteht aus einer Menge S von Sorten wie oben sowie einer Menge F typisierter Funktionssymbole f: e \to e' mit e, e' \in T_p(S), den Operationen von \Sigma.
- obs(\Sigma): die Menge der *beobachtbaren Typen* (observable types) von \Sigma, das sind alle nichtleeren Mengenm die in Typen von Operationen von \Sigma vorkommen.
- \forall f\in F : f: e \to e', dom(f) = e und ran(f) = e'
- \Sigma hei"st *Gentzen-Signatur*, falls \forall f \in F Mengen I, J existieren sodass dom(f) ein I-stelliger Produkttyp und ran(f) ein J-stelliger Summentyp ist.
- Konsrtuktoren dienen der Synthese von Elementen einer S-sortigen Menge, Destruktoren liefern Werkzeuge zu ihrer Analyse.
- Abstrakte Syntax einer CFG ist eine konstruktive Signaturen
- Parser, Interpreter und Compiler beruhen auf Automatenmodelle, die destruktive Signaturen interpretieren

*** Konstruktive Signaturen

**** Mon (\Rightarrow Unmarkierte bin"are B"aume) 
- S = {mon}
- F = {one: 1 \to mon, mul: mon \times mon \to mon}

**** Nat (\Rightarrow N)
- S = {nat}
- F = {zero: 1 \to nat, succ: nat \to nat}

**** Dyn(I, X) (\Rightarrow I \times X^{*})
- S = {list}
- F = {nil: I \to list. cons: X \times list \to list}

**** List(X) =_def Dyn(1, X) (\Rightarrow X^{*})

**** Bintree(X) (\Rightarrow bin"are B"aume endlicher Tiefe mit Knotenmarkierungen aus X)
- S = {btree}
- F = {empty: 1 \to btree, bjoin: btree \times X \times btree \to btree}


**** Tree(X) (\Rightarrow B"aume endlicher Tiefe und endlichen Knotenausgrads mit Knotenmarkierungen aus X)
- S = {tree, trees}
- F = {join: X \times trees \to tree, nil: 1 \to trees, cons: tree \times trees \to trees}

**** Reg(BL) (\Rightarrow regul"are Ausdr"ucke "uber BL)
- S = {reg}
- F = {par: reg \times reg \to reg, seq: reg \times reg \to reg, iter: reg \to reg, base: BL \to reg}

**** CCS(Act) (\Rightarrow Calculus of Communicating Systems)
- S = {proc}
- F = { pre: Act \times proc \to proc, cho: proc \times proc \to proc, par: proc \times proc \to proc, res: proc \times Act \to proc, rel: proc \times Act^{Act} \to proc}


*** Destruktive Signaturen

**** coNat (\Rightarrow N \cup {\infty})
- S = {nat}
- F = {pred: nat \to 1 + nat}

**** coList(X) (\Rightarrow X^{*} \cup X^{N} (coList(1) \cong coNat))
- S = {list, X \times list}
- F = {split: list \to 1+ X \times list, \pi_1: X \times list \to X, \pi_2: X \times list \to list}

**** Stream(X) =_def DAut(1, X) (\Rightarrow X^{N})
- S = {list}
- F = {head: list \to X, tail: list \to list}

**** coBintree(X) (\Rightarrow bin"are B"aume beliebiger Tiefe mit Knotenmarkierungen aus X)
- S = {btree, btree \times X \times btree}
- F = {split: btree \to 1 + btree \times X \times btree, \pi_1: btree \times X \times btree \to btree, \pi_2: btree \times X \times btree \to X, \pi_3: btree \times X \times btree \to btree}

**** Infbintree(X) (\Rightarrow bin"are B"aume unendlicher Tiefe mit Knotenmarkierungen aus X)
- S = {btree}
- F = {root: btree \to X, left, right:btree \to btree}

