Zusammenfassung.tex
\item Satz 2.3 Summen sind \emph{bis auf Isomorphie} eindeutig:
\label{sec-2-3-2-1}
\begin{itemize}
\item Seien (S, $\iota$) und (S', $\iota$') Summen von A. Dann sind P und P' isomorph.
\item Sei (S, $\iota$) eine Summe von A, S' eine Menge und h: S $\to$ S' eine bijektive Abbildung. Dann ist (S', $\iota$') mit $\iota$' = (h . $\iota$$_{\text{i}}$)$_{\text{i} \in \text{I}}$ ebenfalls eine summe von A.
\end{itemize}

Sei (S, $\iota$) eine Summe von (A$_{\text{i}}$)$_{\text{i} \in \text{I}}$, ein (S', $\iota$') eine Summe von (B$_{\text{i}}$)$_{\text{i} \in \text{I}}$ und f = (f$_{\text{i}}$: A$_{\text{i}}$ $\to$ B$_{\text{i}}$)$_{\text{i} \in \text{I}}$
Die Funktion
\begin{center}
\amalg$_{\text{i} \in \text{I}}$f$_{\text{i}}$ =$_{\text{def}}$ [$\iota$$_{\text{i}}$' . f$_{\text{i}}$]: S $\to$ S' 
\end{center}
hei"st Summe von f.


F"ur alle nichtleeren Mengen I,f: A $\to$ B und n>0,
\begin{center}
f \texttimes{} I =$_{\text{def}}$ \amalg$_{\text{i} \in \text{I}}$ f, \\
f$_{\text{1}}$+..+f$_{\text{n}}$ =$_{\text{def}}$ \amalg$_{\text{i} \in \text{[n]}}$ f$_{\text{i}}$, \\
f$^{\text{+}}$ =$_{\text{def}}$ \amalg$_{\text{n} \in \mathbb{N}}$ f$^{\text{[n]}}$, \\
f$^{\text{*}}$ =$_{\text{def}}$ 1 + f$^{\text{+}}$ =$_{\text{def}}$ id$_{\text{1}}$ + f$^{\text{+}}$. \\
\end{center}
\end{enumerate}

\subsection{Typen und Signaturen}
\label{sec-2-4}

Sei S eine Menge von - \textbf{Sorten} genannten - Symbolen.
Die Klasse T$_{\text{p}}$(S) der \textbf{polynomialen Typen "uber} S:
\begin{itemize}
\item S \subseteq T$_{\text{p}}$(S)
\item Jede nichtleere Menge ist ein polynomialer Typ
\item F"ur alle nichtleeren Mengen I und (e$_{\text{i}}$)$_{\text{i}\in\ \text{I}}$$\in$ T$_{\text{p}}$(S)$^{\text{I}}$, $\Pi$$_{\text{i}\in\ \text{I}}$ e$_{\text{i}}$, \amalg$_{\text{i}\in\ \text{I}}$e$_{\text{i}}$ $\in$ T$_{\text{p}}$(S)
\end{itemize}


\begin{itemize}
\item Ein Typ der Form $\Pi$$_{\text{i}\in\ \text{I}}$e$_{\text{i}}$ hei"st \textbf{I-stelliger Produkttyp} mit den \textbf{Faktoren} e$_{\text{i}}$, i$\in$ I.
\item Ein Typ der Form \amalg$_{\text{i}\in\ \text{I}}$e$_{\text{i}}$ hei"st \textbf{I-stelliger Summentyp} mit den \textbf{Summanden} e$_{\text{i}}$, i$\in$ I.
\end{itemize}

F"ur alle n>0, e$_{\text{1}}$,..,e$_{\text{n}}$, e$\in$ T$_{\text{p}}$(S) und nichtleere Mengen I,
\begin{center}
e$_{\text{1}}$ \texttimes{} .. \texttimes{} e$_{\text{n}}$ =$_{\text{def}}$ $\Pi$$_{\text{i} \in \text{[n]}}$e$_{\text{i}}$, \\
e$_{\text{1}}$ + .. + e$_{\text{n}}$ =$_{\text{def}}$ \amalg$_{\text{i} \in \text{[n]}}$e$_{\text{i}}$, \\
e$^{\text{I}}$ =$_{\text{def}}$ $\Pi$$_{\text{i} \in \text{I}}$e$_{\text{i}}$, \\
e$^{\text{n}}$ =$_{\text{def}}$ e$^{\text{[n]}}$, \\
e$^{\text{+}}$ =$_{\text{def}}$ \amalg$_{\text{n>0}}$e$^{\text{n}}$, \\
e$^{\text{*}}$ =$_{\text{def}}$ 1 + e$^{\text{+}}$. \\
\end{center}

Eine S-sortige Menge A wird wie folgt zur T$_{\text{p}}$(S)-sortigen Menge erweitert: F"ur alle nichtleeren Mengen I und (e$_{\text{i}}$)$_{\text{i} \in \text{I}}$

\begin{center}
A$_{\text{I}}$ = I, \\
A$_{\Pi_{\text{i} \in \text{I}}\text{e}_{\text{i}}}$ = \texttimes{}$_{\text{i} \in \text{I}}$ A$_{\text{e}_{\text{i}}}$, \\
A$_{\amalg_{\text{i} \in \text{I}}\text{e}_{\text{i}}}$ = \uplus$_{\text{i} \in \text{I}}$ A$_{\text{e}_{\text{i}}}$.
\end{center}

F"ur alle e $\in$ T$_{\text{p}}$(S) und a $\in$ A$_{\text{e}}$ nennen wir e den Typen von a.

Eine S-sortige Funktion h: A $\to$ B wird wie folgt zur T$_{\text{p}}$(S)-sortigen Menge f"ur alle nichtleeren Mengen I und (e$_{\text{i}}$)$_{\text{i } \in }$ 
$\in$ T$_{\text{p}}$(S)$^{\text{I}}$.

\begin{center}
h$_{\text{I}}$ = id$_{\text{I}}$, \\
h$_{\Pi_{\text{i } \in \text{I}}}$ = $\Pi$$_{\text{i} \in \text{I}}$h$_{\text{e}_{\text{i}}}$, \\
h$_{\amalg_{\text{i } \in \text{I}}}$ = \amalg$_{\text{i} \in \text{I}}$h$_{\text{e}_{\text{i}}}$.
\end{center}


F"ur alle S-sortigen Mengen A, S-sortige Funktionen h: A $\to$ B, n>0, nichtleeren Menge I und e$_{\text{1}}$,..e$_{\text{n}}$, e $\in$ T$_{\text{p}}$(S) gilt Folgendes:
\begin{center}
A$_{\text{e}_{\text{1}} \ \texttimes{}\ \text{.. }\texttimes{}\ \text{e}_{\text{n}}}$ = A$_{\text{e}_{\text{1}}}$ \texttimes{} .. \texttimes{} A$_{\text{e}_{\text{n}}}$, \\
A$_{\text{e}_{\text{1}} \ \text{+ .. + e}_{\text{n}}}$ = A$_{\text{e}_{\text{1}}}$ + .. + A$_{\text{e}_{\text{n}}}$, \\
A$_{\text{e}^{\text{I}}}$ = A$^{\text{I}}_{\text{e}}$, \\
A$_{\text{e}^{\text{n}}}$ = A$^{\text{n}}_{\text{e}}$, \\
A$_{\text{e}^{\text{+}}}$ = A$^{\text{+}}_{\text{e}}$, \\
A$_{\text{e}^{\text{*}}}$ = A$^{\text{*}}_{\text{e}}$, \\

h$_{\text{e}_{\text{1}} \ \texttimes{}\ \text{.. }\texttimes{}\ \text{e}_{\text{n}}}$ = h$_{\text{e}_{\text{1}}}$ \texttimes{} .. \texttimes{} h$_{\text{e}_{\text{n}}}$, \\
h$_{\text{e}_{\text{1}} \ \text{+ .. + e}_{\text{n}}}$ = h$_{\text{e}_{\text{1}}}$ + .. + h$_{\text{e}_{\text{n}}}$, \\
h$_{\text{e}^{\text{I}}}$ = h$^{\text{I}}_{\text{e}}$, \\
h$_{\text{e}^{\text{n}}}$ = h$^{\text{[n]}}_{\text{e}}$, \\
h$_{\text{e}^{\text{+}}}$ = h$^{\text{+}}_{\text{e}}$, \\
h$_{\text{e}^{\text{*}}}$ = h$^{\text{*}}_{\text{e}}$.
\end{center}



\subsection{Signaturen}
\label{sec-2-5}

\begin{itemize}
\item Eine \textbf{Signatur} $\Sigma$ = (S, F) besteht aus einer Menge S von Sorten wie oben sowie einer Menge F typisierter Funktionssymbole f: e $\to$ e' mit e, e' $\in$ T$_{\text{p}}$(S), den Operationen von $\Sigma$.
\item obs($\Sigma$): die Menge der \textbf{beobachtbaren Typen} (observable types) von $\Sigma$, das sind alle nichtleeren Mengenm die in Typen von Operationen von $\Sigma$ vorkommen.
\item $\forall$ f$\in$ F : f: e $\to$ e', dom(f) = e und ran(f) = e'
\item $\Sigma$ hei"st \textbf{Gentzen-Signatur}, falls $\forall$ f $\in$ F Mengen I, J existieren sodass dom(f) ein I-stelliger Produkttyp und ran(f) ein J-stelliger Summentyp ist.
\item Konsrtuktoren dienen der Synthese von Elementen einer S-sortigen Menge, Destruktoren liefern Werkzeuge zu ihrer Analyse.
\item Abstrakte Syntax einer CFG ist eine konstruktive Signaturen
\item Parser, Interpreter und Compiler beruhen auf Automatenmodelle, die destruktive Signaturen interpretieren
\end{itemize}

\subsubsection{Konstruktive Signaturen}
\label{sec-2-5-1}

\begin{enumerate}
\item Mon ($\Rightarrow$ Unmarkierte bin"are B"aume)
\label{sec-2-5-1-1}
\begin{itemize}
\item S = \{mon\}
\item F = \{one: 1 $\to$ mon, mul: mon \texttimes{} mon $\to$ mon\}
\end{itemize}

\item Nat ($\Rightarrow$ N)
\label{sec-2-5-1-2}
\begin{itemize}
\item S = \{nat\}
\item F = \{zero: 1 $\to$ nat, succ: nat $\to$ nat\}
\end{itemize}

\item Dyn(I, X) ($\Rightarrow$ I \texttimes{} X$^{\text{*}}$)
\label{sec-2-5-1-3}
\begin{itemize}
\item S = \{list\}
\item F = \{nil: I $\to$ list. cons: X \texttimes{} list $\to$ list\}
\end{itemize}

\item List(X) =$_{\text{def}}$ Dyn(1, X) ($\Rightarrow$ X$^{\text{*}}$)
\label{sec-2-5-1-4}

\item Bintree(X) ($\Rightarrow$ bin"are B"aume endlicher Tiefe mit Knotenmarkierungen aus X)
\label{sec-2-5-1-5}
\begin{itemize}
\item S = \{btree\}
\item F = \{empty: 1 $\to$ btree, bjoin: btree \texttimes{} X \texttimes{} btree $\to$ btree\}
\end{itemize}


\item Tree(X) ($\Rightarrow$ B"aume endlicher Tiefe und endlichen Knotenausgrads mit Knotenmarkierungen aus X)
\label{sec-2-5-1-6}
\begin{itemize}
\item S = \{tree, trees\}
\item F = \{join: X \texttimes{} trees $\to$ tree, nil: 1 $\to$ trees, cons: tree \texttimes{} trees $\to$ trees\}
\end{itemize}

\item Reg(BL) ($\Rightarrow$ regul"are Ausdr"ucke "uber BL)
\label{sec-2-5-1-7}
\begin{itemize}
\item S = \{reg\}
\item F = \{par: reg \texttimes{} reg $\to$ reg, seq: reg \texttimes{} reg $\to$ reg, iter: reg $\to$ reg, base: BL $\to$ reg\}
\end{itemize}

\item CCS(Act) ($\Rightarrow$ Calculus of Communicating Systems)
\label{sec-2-5-1-8}
\begin{itemize}
\item S = \{proc\}
\item F = \{ pre: Act \texttimes{} proc $\to$ proc, cho: proc \texttimes{} proc $\to$ proc, par: proc \texttimes{} proc $\to$ proc, res: proc \texttimes{} Act $\to$ proc, rel: proc \texttimes{} Act$^{\text{Act}}$ $\to$ proc\}
\end{itemize}
\end{enumerate}


\subsubsection{Destruktive Signaturen}
\label{sec-2-5-2}

\begin{enumerate}
\item coNat ($\Rightarrow$ N $\cup$ \{$\infty$\})
\label{sec-2-5-2-1}
\begin{itemize}
\item S = \{nat\}
\item F = \{pred: nat $\to$ 1 + nat\}
\end{itemize}

\item coList(X) ($\Rightarrow$ X$^{\text{*}}$ $\cup$ X$^{\text{N}}$ (coList(1) $\cong$ coNat))
\label{sec-2-5-2-2}
\begin{itemize}
\item S = \{list, X \texttimes{} list\}
\item F = \{split: list $\to$ 1+ X \texttimes{} list, $\pi$$_{\text{1}}$: X \texttimes{} list $\to$ X, $\pi$$_{\text{2}}$: X \texttimes{} list $\to$ list\}
\end{itemize}

\item Stream(X) =$_{\text{def}}$ DAut(1, X) ($\Rightarrow$ X$^{\text{N}}$)
\label{sec-2-5-2-3}
\begin{itemize}
\item S = \{list\}
\item F = \{head: list $\to$ X, tail: list $\to$ list\}
\end{itemize}

\item coBintree(X) ($\Rightarrow$ bin"are B"aume beliebiger Tiefe mit Knotenmarkierungen aus X)
\label{sec-2-5-2-4}
\begin{itemize}
\item S = \{btree, btree \texttimes{} X \texttimes{} btree\}
\item F = \{split: btree $\to$ 1 + btree \texttimes{} X \texttimes{} btree, $\pi$$_{\text{1}}$: btree \texttimes{} X \texttimes{} btree $\to$ btree, $\pi$$_{\text{2}}$: btree \texttimes{} X \texttimes{} btree $\to$ X, $\pi$$_{\text{3}}$: btree \texttimes{} X \texttimes{} btree $\to$ btree\}
\end{itemize}

\item Infbintree(X) ($\Rightarrow$ bin"are B"aume unendlicher Tiefe mit Knotenmarkierungen aus X)
\label{sec-2-5-2-5}
\begin{itemize}
\item S = \{btree\}
\item F = \{root: btree $\to$ X, left, right:btree $\to$ btree\}
\end{itemize}
