Zusammenfassung.org
**** DAut(X,Y) (\Rightarrow Y^{X^{*}} = Verhalten det. Moore-Automaten mit Eingabemenge X und Ausgabemenge Y)
- S = {state, state^X}
- F = {\delta: state \to state^X, \beta: state \to Y} \cup {\pi_x: state^X \to state | x\in X}

**** Acc(X) =_def DAut(X,2) (\Rightarrow P(X^{*}) = Wortsprache "uber X)

**** Proctree(Act) (\Rightarrow Prozessb"aume, deren Kanten mit Aktionen markiert sind)
- S = {tree} \cup {(Act \times tree)^n | n > 0}
- F = {\delta: tree \to (Act \times tree)^{*}} \cup {\pi_n: (Act \times tree)^n \to Act \times tree | n > 0} \cup {\pi_1: Act \times tree \to Act, \pi_2: Act \times tree \to tree}

** Algebren

Sei \Sigma = (S, F) eine Signatur. Eine \Sigma- *Algebra* A = (A, Op) besteht aus einer S-sortigen Menge A und einer F-sortigen Menge
#+BEGIN_CENTER
Op = (f^A: A_e \to A_{e'})_{f: e\[ \to \]e'\[ \in \]F}
#+END_CENTER 
von Funktionen, den Operationen von A.
F"ur alle s \in S hei"st A_s Tr"agermenge (carrier set) oder Interpretation von s in A. F"ur alle f: e \to e' \in F hei"st f^A : A_e \to A_{e'} Interpreation von f in A.

Seien A, B \Sigma-Algebren. Eine S-sortige Funktion h: A \to B hei"st \Sigma-Homomorphismus, wenn f"ur alle f: e \to e' \in F
#+BEGIN_CENTER
h_{e'} \bigcirc f^A = f^B \bigcirc h_e
#+END_CENTER
gilt. Ist h bijektiv, dann hei"st h \Sigma-Isomorphismus und A und B sind \Sigma-isomorph. h induziert die Bildalgebra h(A):
- F"ur alle e\in T_p(S), h(A)_e =_def h_e(A_e)
- F"ur alle f: e\to e' \in F und a \in A_e, f^{h(A)}(h(a)) =_def f^B(h(a))

*** Beispiele

**** Nat-Algebra
- zero^N: 1 \to N, succ^N: N \to N
- zreo^N(\epsilon) = 0, succ^N(n) = n + 1

**** Word(X) (eine Mon-Algebra)
- one^{Word(X)}: 1 \to X^{*}, mul^{Word(X)}: X^{*} \times X^{*} \to X^{*}
- one^{Word(X)}(\epsilon) = \epsilon, mult^{Word(X)}(u, v) = uv 


** Terme und Coterme
*** Terme 
Sei \Sigma = (S,C) eine konstruktive Signatur, X = \cup obs(\Sigma) und V eine S-sortige Menge von "Variablen".
Die Menge CT_\Sigma(V) der \Sigma-Terme "uber V ist die gr"o"ste (S \cup obs(\Sigma))-sortige Menge M  det. B"aume "uber (X, C \cup X \cup V)
mit folgenden Eigenschaften:

- F"ur alle B \in obs(\Sigma), M_B = B (1)
- F"ur alle s \in S und t \in M_s ist t \in V_s (2) oder gibt es c: \Pi_{i\[ \in \]I}s_i \to s \in C und (t_i)_{i\[ \in \]I} \in \times_{i\[ \in \]I}M_{s_i} mit t = c{i \to t_i | i \in I} (3)




**** Fall 
\\ 
\Tree [.b ] \\
b \in B, 
B \in obs(\Sigma) \\

**** Fall
\\
\Tree [.x ] \\
x ist von s, s \in S, x \in V_s 

**** Fall
\\
\Tree [.c \ldots \\
          \ldots \\
	  \ldots \\
	  [.i s_i ]
	  \ldots \\ ]

c: \Pi_{i\[ \in \]I} s_i \to s \in C


- Die Elemente von CT_\Sigma =_def CT_\Sigma(\lambda x. \emptyset) hei"sen \Sigma-Grundterme.

*** Coterme 
Sei \Sigma = (S, D) eine destruktive Signatur und V eine S-sortige Menge von Farbe oder Covariablen.

Die Menge DT_\Sigma(V) der \Sigma-Coterme "uber V ist die gr"o"ste Menge (S \cup obs(\Sigma))-sortige Menge M det. B"aume "uber (D \cup {!}, X \cup V) mit (1) und folgender Eigenschaft
- F"ur alle s \in S, t \in M_s, d: s \to \amalg_{i\[ \in \]I}s_i \in D gibt es x \in V_s, i_d \in I und t_d \in M_{s_i} mit t =x{d \to i{! \to t_d} | d: s \to e \in D}

**** Fall
\\ 
\Tree [.b ] \\
b \in B, 
B \in obs(\Sigma) \\

**** Fall
\\
\Tree [.x \ldots \\
          \ldots \\
	  \ldots \\
	  [.i s_i ]
	  \ldots \\ ]

x \in V_s
c: s \to \amalg_{i\[ \in \]I} s_i  \in D

Ist I einelementig, dann stimmt \amalg_{i\[ \in \]I}s_i mit s_i "uberein, so dass die mit ! markierte Kante entf"allt.

** /Bool/-Algebra 
Die Menge 2 ist Tr"agermenge der REG(BL)-Algebra /Bool/.

F"ur alle x, y \in 2 und B \in BL \ 1:
#+BEGIN_CENTER
par^{Bool}(x, y) = max{x,y}, \\
seq^{Bool}(x, y) = x*y, \\
iter^{Bool}(x) = 1, \\
base^{Bool}(1) = 1, \\
bas^{Bool}(B) = 0. \\
#+END_CENTER


** Termfaltung
- \Sigma = (S, C)
- V eine S-sortige Menge 
- A = (A, Op) eine \Sigma-Algebra
- g: V \to A eine *Variablenbelegung* (/valuation/)
- g^{*} intuitiv definiert.


Offenbar h"angt die Einschr"ankung von g* auf Grundterme nicht von g ab. Sie wird *Termfaltung* genannt und mit fold^A bezeichnet.

Folglich ist fold^A der einzige \Sigma-Homomorphismus von T_\Sigma nach A

** Zustandsentfaltung
- \Sigma = (S, D) 
- V eine S-sortige Menge 
- A = (A, Op) eine \Sigma-Algebra
- g: A \to V eine F"arbung
- g^{#} intuitiv definiert

Offenbar h"angt die Einschr"ankung von g^{#} auf Grundterme nicht von g ab. Sie wird *Zustandsentfaltung* genannt und mit unfold^A bezeichnet.
 
* Rechnen mit Algebren 

** Unteralgebra
Bez"uglich der Operationen geschlossene Untermenge.

** Substitution 
\sigma^{*}: T_\Sigma(V) \to T_\Sigma(V)

** Term"aquivalenz 
\forall t,t' \in E, g \in A^V : g^{*}(t) = g^{*}(t')


** Normalformen 
Werden f"ur jede Signatur selbst definiert und k"onnen durch das verwenden definierter Gleichungen erzeugt Werden

* Kontextfreie Grammatiken (CFGs)

** Definition 
G = (S, BS, R) mit 

- einer endlichen Menge S von *Sorten*, die auch Nichtterminale oder Variablen genannt werden 
- BS, eine Menge nichtleerer Basismengen 
- eine endliche Menge R von Regeln s \to w mit s \in S und \\ w \in (S \cup BS)^{*} \ {s} 

** Die JavaLight Grammatik
*** R
- Commands \to Command Commands | Command 
- Command \to {Commands} | String = Sum; | \\ if Disjunct Command else Command | \\ if Disjunct Command | while Disjunct Command
- Sum \to Sum + Prod | Sum - Prod | Prod 
- Prod \to Prod * Factor | Prod/Factor | Factor
- Factor \to Z | String | (Sum)
- Disjunct \to Conjunct || Disjunct | Conjunct
- Conjunct \to Literal && Conjunct | Literal
- Literal \to !Literal | Sum Rel Sum | 2 | (Disjunct)

*** BS
- String (alle Zeichenfolgen au"ser Elementen anderer Basismengen von JavaLight)
- Z
- Rel (nicht n"aher spezifizierter bin"arer Relationen auf Z

** Beispiel Programm

fact = 1; while x > 1 {fact = fact*x; x = x-1;}

** Linksrekursive Grammatiken

Sei G = (S, BS, R) und X = \cup BS. 

X ist die Menge der Eingabesymbole, die Compiler f"ur G verarbeiten m"ussen.

*** Einschub Ableitungsrelation
\to_G = {(vsw, v\alpha w), s \to \alpha \in R, v,w \in (S \cup BS)^{*}}.


*** Definition
- G hei"st *linksrekursiv*, falls es eine *linkrekursive* Ableitung s \to_G sv gibt. 
- G hei"st LL-kompilierbar, falls es eine partielle Ordnung \leq auf S gibt mit s' \leq s f"ur alle Ableitungen sv \to_G s'w
**** Umgangssprachlich
Man hat eine Regel, sodass die Sorte auf der linken Seite auf der rechten Seite ganz links vorkommt.

