Zusammenfassung.tex

\item DAut(X,Y) ($\Rightarrow$ Y$^{\text{X}^{\text{*}}}$ = Verhalten det. Moore-Automaten mit Eingabemenge X und Ausgabemenge Y)
\label{sec-2-5-2-6}
\begin{itemize}
\item S = \{state, state$^{\text{X}}$\}
\item F = \{$\delta$: state $\to$ state$^{\text{X}}$, $\beta$: state $\to$ Y\} $\cup$ \{$\pi$$_{\text{x}}$: state$^{\text{X}}$ $\to$ state | x$\in$ X\}
\end{itemize}

\item Acc(X) =$_{\text{def}}$ DAut(X,2) ($\Rightarrow$ P(X$^{\text{*}}$) = Wortsprache "uber X)
\label{sec-2-5-2-7}

\item Proctree(Act) ($\Rightarrow$ Prozessb"aume, deren Kanten mit Aktionen markiert sind)
\label{sec-2-5-2-8}
\begin{itemize}
\item S = \{tree\} $\cup$ \{(Act \texttimes{} tree)$^{\text{n}}$ | n > 0\}
\item F = \{$\delta$: tree $\to$ (Act \texttimes{} tree)$^{\text{*}}$\} $\cup$ \{$\pi$$_{\text{n}}$: (Act \texttimes{} tree)$^{\text{n}}$ $\to$ Act \texttimes{} tree | n > 0\} $\cup$ \{$\pi$$_{\text{1}}$: Act \texttimes{} tree $\to$ Act, $\pi$$_{\text{2}}$: Act \texttimes{} tree $\to$ tree\}
\end{itemize}
\end{enumerate}

\subsection{Algebren}
\label{sec-2-6}

Sei $\Sigma$ = (S, F) eine Signatur. Eine $\Sigma$- \textbf{Algebra} A = (A, Op) besteht aus einer S-sortigen Menge A und einer F-sortigen Menge
\begin{center}
Op = (f$^{\text{A}}$: A$_{\text{e}}$ $\to$ A$_{\text{e'}}$)$_{\text{f: e} \to \text{e'} \in \text{F}}$
\end{center}
von Funktionen, den Operationen von A.
F"ur alle s $\in$ S hei"st A$_{\text{s}}$ Tr"agermenge (carrier set) oder Interpretation von s in A. F"ur alle f: e $\to$ e' $\in$ F hei"st f$^{\text{A}}$ : A$_{\text{e}}$ $\to$ A$_{\text{e'}}$ Interpreation von f in A.

Seien A, B $\Sigma$-Algebren. Eine S-sortige Funktion h: A $\to$ B hei"st $\Sigma$-Homomorphismus, wenn f"ur alle f: e $\to$ e' $\in$ F
\begin{center}
h$_{\text{e'}}$ \bigcirc f$^{\text{A}}$ = f$^{\text{B}}$ \bigcirc h$_{\text{e}}$
\end{center}
gilt. Ist h bijektiv, dann hei"st h $\Sigma$-Isomorphismus und A und B sind $\Sigma$-isomorph. h induziert die Bildalgebra h(A):
\begin{itemize}
\item F"ur alle e$\in$ T$_{\text{p}}$(S), h(A)$_{\text{e}}$ =$_{\text{def}}$ h$_{\text{e}}$(A$_{\text{e}}$)
\item F"ur alle f: e$\to$ e' $\in$ F und a $\in$ A$_{\text{e}}$, f$^{\text{h(A)}}$(h(a)) =$_{\text{def}}$ f$^{\text{B}}$(h(a))
\end{itemize}

\subsubsection{Beispiele}
\label{sec-2-6-1}

\begin{enumerate}
\item Nat-Algebra
\label{sec-2-6-1-1}
\begin{itemize}
\item zero$^{\text{N}}$: 1 $\to$ N, succ$^{\text{N}}$: N $\to$ N
\item zreo$^{\text{N}}$($\epsilon$) = 0, succ$^{\text{N}}$(n) = n + 1
\end{itemize}

\item Word(X) (eine Mon-Algebra)
\label{sec-2-6-1-2}
\begin{itemize}
\item one$^{\text{Word(X)}}$: 1 $\to$ X$^{\text{*}}$, mul$^{\text{Word(X)}}$: X$^{\text{*}}$ \texttimes{} X$^{\text{*}}$ $\to$ X$^{\text{*}}$
\item one$^{\text{Word(X)}}$($\epsilon$) = $\epsilon$, mult$^{\text{Word(X)}}$(u, v) = uv
\end{itemize}
\end{enumerate}


\subsection{Terme und Coterme}
\label{sec-2-7}
\subsubsection{Terme}
\label{sec-2-7-1}
Sei $\Sigma$ = (S,C) eine konstruktive Signatur, X = $\cup$ obs($\Sigma$) und V eine S-sortige Menge von "Variablen".
Die Menge CT$_{\Sigma}$(V) der $\Sigma$-Terme "uber V ist die gr"o"ste (S $\cup$ obs($\Sigma$))-sortige Menge M  det. B"aume "uber (X, C $\cup$ X $\cup$ V)
mit folgenden Eigenschaften:

\begin{itemize}
\item F"ur alle B $\in$ obs($\Sigma$), M$_{\text{B}}$ = B (1)
\item F"ur alle s $\in$ S und t $\in$ M$_{\text{s}}$ ist t $\in$ V$_{\text{s}}$ (2) oder gibt es c: $\Pi$$_{\text{i} \in \text{I}}$s$_{\text{i}}$ $\to$ s $\in$ C und (t$_{\text{i}}$)$_{\text{i} \in \text{I}}$ $\in$ \texttimes{}$_{\text{i} \in \text{I}}$M$_{\text{s}_{\text{i}}}$ mit t = c\{i $\to$ t$_{\text{i}}$ | i $\in$ I\} (3)
\end{itemize}




\begin{enumerate}
\item Fall
\label{sec-2-7-1-1}
\\ 
\Tree [.b ] \\
b $\in$ B, 
B $\in$ obs($\Sigma$) \\

\item Fall
\label{sec-2-7-1-2}
\\
\Tree [.x ] \\
x ist von s, s $\in$ S, x $\in$ V$_{\text{s}}$ 

\item Fall
\label{sec-2-7-1-3}
\\
\Tree [.c \ldots \\
          \ldots \\
          \ldots \\
          [.i s$_{\text{i}}$ ]
          \ldots \\ ]

c: $\Pi$$_{\text{i} \in \text{I}}$ s$_{\text{i}}$ $\to$ s $\in$ C


\begin{itemize}
\item Die Elemente von CT$_{\Sigma}$ =$_{\text{def}}$ CT$_{\Sigma}$($\lambda$ x. $\emptyset$) hei"sen $\Sigma$-Grundterme.
\end{itemize}
\end{enumerate}

\subsubsection{Coterme}
\label{sec-2-7-2}
Sei $\Sigma$ = (S, D) eine destruktive Signatur und V eine S-sortige Menge von Farbe oder Covariablen.

Die Menge DT$_{\Sigma}$(V) der $\Sigma$-Coterme "uber V ist die gr"o"ste Menge (S $\cup$ obs($\Sigma$))-sortige Menge M det. B"aume "uber (D $\cup$ \{!\}, X $\cup$ V) mit (1) und folgender Eigenschaft
\begin{itemize}
\item F"ur alle s $\in$ S, t $\in$ M$_{\text{s}}$, d: s $\to$ \amalg$_{\text{i} \in \text{I}}$s$_{\text{i}}$ $\in$ D gibt es x $\in$ V$_{\text{s}}$, i$_{\text{d}}$ $\in$ I und t$_{\text{d}}$ $\in$ M$_{\text{s}_{\text{i}}}$ mit t =x\{d $\to$ i\{! $\to$ t$_{\text{d}}$\} | d: s $\to$ e $\in$ D\}
\end{itemize}

\begin{enumerate}
\item Fall
\label{sec-2-7-2-1}
\\ 
\Tree [.b ] \\
b $\in$ B, 
B $\in$ obs($\Sigma$) \\

\item Fall
\label{sec-2-7-2-2}
\\
\Tree [.x \ldots \\
          \ldots \\
          \ldots \\
          [.i s$_{\text{i}}$ ]
          \ldots \\ ]

x $\in$ V$_{\text{s}}$
c: s $\to$ \amalg$_{\text{i} \in \text{I}}$ s$_{\text{i}}$  $\in$ D

Ist I einelementig, dann stimmt \amalg$_{\text{i} \in \text{I}}$s$_{\text{i}}$ mit s$_{\text{i}}$ "uberein, so dass die mit ! markierte Kante entf"allt.
\end{enumerate}

\subsection{\emph{Bool}-Algebra}
\label{sec-2-8}
Die Menge 2 ist Tr"agermenge der REG(BL)-Algebra \emph{Bool}.

F"ur alle x, y $\in$ 2 und B $\in$ BL $\backslash$ 1:
\begin{center}
par$^{\text{Bool}}$(x, y) = max\{x,y\}, \\
seq$^{\text{Bool}}$(x, y) = x*y, \\
iter$^{\text{Bool}}$(x) = 1, \\
base$^{\text{Bool}}$(1) = 1, \\
bas$^{\text{Bool}}$(B) = 0. \\
\end{center}


\subsection{Termfaltung}
\label{sec-2-9}
\begin{itemize}
\item $\Sigma$ = (S, C)
\item V eine S-sortige Menge
\item A = (A, Op) eine $\Sigma$-Algebra
\item g: V $\to$ A eine \textbf{Variablenbelegung} (\emph{valuation})
\item g$^{\text{*}}$ intuitiv definiert.
\end{itemize}


Offenbar h"angt die Einschr"ankung von g* auf Grundterme nicht von g ab. Sie wird \textbf{Termfaltung} genannt und mit fold$^{\text{A}}$ bezeichnet.

Folglich ist fold$^{\text{A}}$ der einzige $\Sigma$-Homomorphismus von T$_{\Sigma}$ nach A

\subsection{Zustandsentfaltung}
\label{sec-2-10}
\begin{itemize}
\item $\Sigma$ = (S, D)
\item V eine S-sortige Menge
\item A = (A, Op) eine $\Sigma$-Algebra
\item g: A $\to$ V eine F"arbung
\item g$^{\text{\#}}$ intuitiv definiert
\end{itemize}

Offenbar h"angt die Einschr"ankung von g$^{\text{\#}}$ auf Grundterme nicht von g ab. Sie wird \textbf{Zustandsentfaltung} genannt und mit unfold$^{\text{A}}$ bezeichnet.

\section{Rechnen mit Algebren}
\label{sec-3}

\subsection{Unteralgebra}
\label{sec-3-1}
Bez"uglich der Operationen geschlossene Untermenge.

\subsection{Substitution}
\label{sec-3-2}
$\sigma$$^{\text{*}}$: T$_{\Sigma}$(V) $\to$ T$_{\Sigma}$(V)

\subsection{Term"aquivalenz}
\label{sec-3-3}
$\forall$ t,t' $\in$ E, g $\in$ A$^{\text{V}}$ : g$^{\text{*}}$(t) = g$^{\text{*}}$(t')


\subsection{Normalformen}
\label{sec-3-4}
Werden f"ur jede Signatur selbst definiert und k"onnen durch das verwenden definierter Gleichungen erzeugt Werden

\section{Kontextfreie Grammatiken (CFGs)}
\label{sec-4}

\subsection{Definition}
\label{sec-4-1}
G = (S, BS, R) mit 

\begin{itemize}
\item einer endlichen Menge S von \textbf{Sorten}, die auch Nichtterminale oder Variablen genannt werden
\item BS, eine Menge nichtleerer Basismengen
\item eine endliche Menge R von Regeln s $\to$ w mit s $\in$ S und \\ w $\in$ (S $\cup$ BS)$^{\text{*}}$ $\backslash$ \{s\}
\end{itemize}

\subsection{Die JavaLight Grammatik}
\label{sec-4-2}
\subsubsection{R}
\label{sec-4-2-1}
\begin{itemize}
\item Commands $\to$ Command Commands | Command
\item Command $\to$ \{Commands\} | String = Sum; | \\ if Disjunct Command else Command | \\ if Disjunct Command | while Disjunct Command
\item Sum $\to$ Sum + Prod | Sum - Prod | Prod
\item Prod $\to$ Prod * Factor | Prod/Factor | Factor
\item Factor $\to$ Z | String | (Sum)
\item Disjunct $\to$ Conjunct || Disjunct | Conjunct
\item Conjunct $\to$ Literal \&\& Conjunct | Literal
\item Literal $\to$ !Literal | Sum Rel Sum | 2 | (Disjunct)
\end{itemize}

\subsubsection{BS}
\label{sec-4-2-2}
\begin{itemize}
\item String (alle Zeichenfolgen au"ser Elementen anderer Basismengen von JavaLight)
\item Z
\item Rel (nicht n"aher spezifizierter bin"arer Relationen auf Z
\end{itemize}

\subsection{Beispiel Programm}
\label{sec-4-3}

fact = 1; while x > 1 \{fact = fact*x; x = x-1;\}

\subsection{Linksrekursive Grammatiken}
\label{sec-4-4}

Sei G = (S, BS, R) und X = $\cup$ BS. 

X ist die Menge der Eingabesymbole, die Compiler f"ur G verarbeiten m"ussen.

\subsubsection{Einschub Ableitungsrelation}
\label{sec-4-4-1}
$\to$$_{\text{G}}$ = \{(vsw, v$\alpha$ w), s $\to$ $\alpha$ $\in$ R, v,w $\in$ (S $\cup$ BS)$^{\text{*}}$\}.


\subsubsection{Definition}
\label{sec-4-4-2}
\begin{itemize}
\item G hei"st \textbf{linksrekursiv}, falls es eine \textbf{linkrekursive} Ableitung s $\to$$_{\text{G}}$ sv gibt.
\item G hei"st LL-kompilierbar, falls es eine partielle Ordnung $\le$ auf S gibt mit s' $\le$ s f"ur alle Ableitungen sv $\to$$_{\text{G}}$ s'w
\end{itemize}
\begin{enumerate}
\item Umgangssprachlich
\label{sec-4-4-2-1}
Man hat eine Regel, sodass die Sorte auf der linken Seite auf der rechten Seite ganz links vorkommt.
\end{enumerate}
