Zusammenfassung.org
*** Beispiel
Z.B. REG ist LL-kompilierbar, JavaLight jedoch _nicht_. 

*** Verfahren zur Elemenierung von Linksrekursion
Sei G = (S, BS, R) und S = {s_1,..,s_n}.

F"uhre f"ur alle 1 \leq i \leq n die beiden folgenden Schritte in der angegebenen Reihenfolge durch:

- F"ur alle 1 \leq j \leq i und Regelpaare (s_i \to s_{j}v, s_j \to w) ersetze dir Regel s_i \to s_{j}v durch s_i \to wv
- Falls vorhanden, streiche die Regel s_i \to s_i
- F"ur alle Regelpaare (s_i \to v, s_i \to s_{i}w) mit \notin {s_i} \times (S \cup BS)^{*} ersetze die beiden Regeln durch die drei neuen Regeln s_i \to vs'_i, s'_i \to ws'_i und s'_i \to \epsilon


**** Beispiel JavaLight

- Commands \to Command Commands | Command 
- Command \to {Commands} | String = Sum; | \\ if Disjunct Command else Command | \\ if Disjunct Command | while Disjunct Command
- Sum \to Prod Sumsect
- Sumsect \to + Prod Sumsect | - Prod Sumsect | \epsilon  
- Prod \to Factor Prodsect
- Prodsect \to * Factor Prodsect | / Factor Prodsect | \epsilon
- Factor \to Z | String | (Sum)
- Disjunct \to Conjunct || Disjunct | Conjunct
- Conjunct \to Literal && Conjunct | Literal
- Literal \to !Literal | Sum Rel Sum | 2 | (Disjunct)



** Abstrakte Syntax 

Sei G = (S, BS, R) eine CFG.

Die folgende Funktion typ: (S \cup BS)^{*} \to T_p(S) streicht alle Elemente von Z(G) aus W"ortern "uber S \cup BS und "uberf"uhrt diese
in die durch sie bezeichneten Produkttypen:

- typ(\epsilon) = 1
- F"ur alle s \in S \cup BS \ Z(G) und w \in (S \cup BS)^{*}, typ(sw) = s \times typ(w)
- F"ur alle x \in Z und w \in (S \cup BS)^{*}, typ(xw) = typ(w)

Dann ist \Sigma(G) = (S, BS, {f_{s \to w}:typ(w) \to s | s \to w \in R})


\Sigma(G)-Grundterme werden Syntaxb"aume von G genannt.

*** Beispiel JavaLight
- S = {Commands, Command, Sum, Prod, Factor, Disjunct, Conjunct, Literal}
- \Iota = {Z, String, Rel, 2}
- F = { \\ seq: Command \times Commands \to Commands, \\ embed: Command \to Commands, \\ block: Commands \to Command, \\ assign: String \times Sum \to Command, \\ cond: Disjunct \times Command \times Command \to Command, \\ cond1, loop: Disjunct \times Command \to Command, \\ _sum_: Prod \to Sum, \\ _plus_, _minus_: Sum \times Prod \to Sum, \\ _prod_: Factor \to Prod, \\ _times_, _div_: Prod \times Factor \to Prod, \\ embedI: Z \to Factor, \\ var: String \to Factor, \\ encloseS: Sum \to Factor, \\ disjunct: Conjunct \times Disjunct \to Disjunct, \\ embedC: Conjunct \to Disjunct, \\ conjunct: Literal \times Conjunct \to Conjunct, \\ embedL: Literal \to Conjunct, \\ not: Literal \to Literal, \\ atom: Rel \times Sum \times Sum \to Literal, \\ embedB: 2 \to Literal, \\ encloseD: Disjunct \to Literal}


*** JavaLight' (entlinksrekursiv)
- wird um die Sorten Sumsect und Prodsect erweitert und um die Konstruktoren 
- sum: Prod \times Sumsect \to Sum, \\ plus, minus: Prod \times Sumsect \to Sumsect, \\ nilS: 1 \to Sumsect, \\ prod: Factor \times Prodsect \to Prod, \\ times, div: Factor \times Prodsect \to Prodsect, \\ nilP: 1 \to Prodsect

*** Syntaxbaum Beispiel
Beispiel Programm:
- fact = 1; while x > 1 {fact = fact*x; x = x-1;}

\begin{tikzpicture}[grow'=right, level distance=0.6in]
\Tree [.Seq 
            [.Assign fact 
	                  [.Sum 
			        [.Prod 
				       [.EmbedI 1 ] 
				       NilP ]
				NilS ]]
	    [.Embed 
	            [.Loop
		           [.EmbedC 
			            [.EmbedL 
				             [.Atom > 
			                            [.Sum 
						          [.Prod 
							         [.Var x ]
								 [.NilP ]]
							  [.NilS ]]
						    [.Sum 
						          [.Prod 
							         [.EmbedI 1 ]
								 [.NilP ]]
							  [.NilS ]]]]]
		    [.Block 
		            [.Seq 
		                  [.Assign
				           fact 
					   [.Sum 
					         [.Prod 
						        [.Var fact ]
							[.Times 
							        [.Var x ]
								[.NilP ]]]
						 [.NilS ]]]
				  [.Embed 
				          [.Assign
					           x
						   [.Sum 
						         [.Prod
							        [.Var x ]
								[.NilP ]]
							 [.Minus 
							         [.Prod
								        [.EmbedI 1 ]
									[.NilP ]]
								 [.NilS ]]]]]]]]]]
\end{tikzpicture}

** Definition derec(G)

- F"ur alle s \in S \cup BS \ Z(G), derec(G)_s = T_{\Sigma(G'),s}
- F"ur alle s \in S \ recs(S) und s \to v \in R und t \in T_{\Sigma(G'),typ(v)}, f_{s \to v}^{derec(G)}(t) = f_{s \to v}(t)
- F"ur alle s \to v \in nonrecs(R), s \to sw \in R, t \in T_{\Sigma(G'),typ(v)}, t' \in T_{\Sigma(G'),s'} und u \in T_{\Sigma(G'), typ(w)} \\ f_{s \to v}^{derec(G)}(t) = f_{s \to vs'}(t, f_{s' \to \epsilon}) \\ f_{s \to sw}^{derec(G)}(f_{s \to vs'}(t,t'),u) = f_{s \to vs'}(t, f_{s' \to ws'}(u, t')) 

Mit derec(G) kann man eine Syntaxbaum in G in einen Syntaxbaum der nicht linksrekursiven Grammatik G' umwandeln


** Wort- und Ableitungsbaumalgebra
Neben T_{\Sigma(g)} lassen sich auch die Menge der W"orter "uber X und die Menge der Ableitungsb"aume von G zu \Sigma(G)-Algebren erweitern.

*** Wortalgebra
fold^{Word(G)} bildet Terme auf die entsprechenden W"orter der Sprache. 

*** Ableitungsbaumalgebra
Bildet auf einen Baum ab, der auch die W"orter darstellt (inklusive der Terminale aus Z(G))

** Zustandsmodell von JavaLight
- Sei Store = String \to Z (Variablenbelegung)

- Wir bilden eine \Sigma(JavaLight)-Algebra

*** Sorten
- A_Commands = A_Command = Store \to Store 
- A_Sum = A_Factor = A_Prod = Store \to Z 
- A_Disjunkt = A_Conjunct = A_Literal = Store \to 2

