Zusammenfassung.tex

\subsubsection{Beispiel}
\label{sec-4-4-3}
Z.B. REG ist LL-kompilierbar, JavaLight jedoch \uline{nicht}. 

\subsubsection{Verfahren zur Elemenierung von Linksrekursion}
\label{sec-4-4-4}
Sei G = (S, BS, R) und S = \{s$_{\text{1}}$,..,s$_{\text{n}}$\}.

F"uhre f"ur alle 1 $\le$ i $\le$ n die beiden folgenden Schritte in der angegebenen Reihenfolge durch:

\begin{itemize}
\item F"ur alle 1 $\le$ j $\le$ i und Regelpaare (s$_{\text{i}}$ $\to$ s$_{\text{j}}$v, s$_{\text{j}}$ $\to$ w) ersetze dir Regel s$_{\text{i}}$ $\to$ s$_{\text{j}}$v durch s$_{\text{i}}$ $\to$ wv
\item Falls vorhanden, streiche die Regel s$_{\text{i}}$ $\to$ s$_{\text{i}}$
\item F"ur alle Regelpaare (s$_{\text{i}}$ $\to$ v, s$_{\text{i}}$ $\to$ s$_{\text{i}}$w) mit $\notin$ \{s$_{\text{i}}$\} \texttimes{} (S $\cup$ BS)$^{\text{*}}$ ersetze die beiden Regeln durch die drei neuen Regeln s$_{\text{i}}$ $\to$ vs'$_{\text{i}}$, s'$_{\text{i}}$ $\to$ ws'$_{\text{i}}$ und s'$_{\text{i}}$ $\to$ $\epsilon$
\end{itemize}


\begin{enumerate}
\item Beispiel JavaLight
\label{sec-4-4-4-1}

\begin{itemize}
\item Commands $\to$ Command Commands | Command
\item Command $\to$ \{Commands\} | String = Sum; | \\ if Disjunct Command else Command | \\ if Disjunct Command | while Disjunct Command
\item Sum $\to$ Prod Sumsect
\item Sumsect $\to$ + Prod Sumsect | - Prod Sumsect | $\epsilon$
\item Prod $\to$ Factor Prodsect
\item Prodsect $\to$ * Factor Prodsect | / Factor Prodsect | $\epsilon$
\item Factor $\to$ Z | String | (Sum)
\item Disjunct $\to$ Conjunct || Disjunct | Conjunct
\item Conjunct $\to$ Literal \&\& Conjunct | Literal
\item Literal $\to$ !Literal | Sum Rel Sum | 2 | (Disjunct)
\end{itemize}
\end{enumerate}



\subsection{Abstrakte Syntax}
\label{sec-4-5}

Sei G = (S, BS, R) eine CFG.

Die folgende Funktion typ: (S $\cup$ BS)$^{\text{*}}$ $\to$ T$_{\text{p}}$(S) streicht alle Elemente von Z(G) aus W"ortern "uber S $\cup$ BS und "uberf"uhrt diese
in die durch sie bezeichneten Produkttypen:

\begin{itemize}
\item typ($\epsilon$) = 1
\item F"ur alle s $\in$ S $\cup$ BS $\backslash$ Z(G) und w $\in$ (S $\cup$ BS)$^{\text{*}}$, typ(sw) = s \texttimes{} typ(w)
\item F"ur alle x $\in$ Z und w $\in$ (S $\cup$ BS)$^{\text{*}}$, typ(xw) = typ(w)
\end{itemize}

Dann ist $\Sigma$(G) = (S, BS, \{f$_{\text{s }\to\ \text{w}}$:typ(w) $\to$ s | s $\to$ w $\in$ R\})


$\Sigma$(G)-Grundterme werden Syntaxb"aume von G genannt.

\subsubsection{Beispiel JavaLight}
\label{sec-4-5-1}
\begin{itemize}
\item S = \{Commands, Command, Sum, Prod, Factor, Disjunct, Conjunct, Literal\}
\item I = \{Z, String, Rel, 2\}
\item F = \{ \\ seq: Command \texttimes{} Commands $\to$ Commands, \\ embed: Command $\to$ Commands, \\ block: Commands $\to$ Command, \\ assign: String \texttimes{} Sum $\to$ Command, \\ cond: Disjunct \texttimes{} Command \texttimes{} Command $\to$ Command, \\ cond1, loop: Disjunct \texttimes{} Command $\to$ Command, \\ \uline{sum}: Prod $\to$ Sum, \\ \uline{plus}, \uline{minus}: Sum \texttimes{} Prod $\to$ Sum, \\ \uline{prod}: Factor $\to$ Prod, \\ \uline{times}, \uline{div}: Prod \texttimes{} Factor $\to$ Prod, \\ embedI: Z $\to$ Factor, \\ var: String $\to$ Factor, \\ encloseS: Sum $\to$ Factor, \\ disjunct: Conjunct \texttimes{} Disjunct $\to$ Disjunct, \\ embedC: Conjunct $\to$ Disjunct, \\ conjunct: Literal \texttimes{} Conjunct $\to$ Conjunct, \\ embedL: Literal $\to$ Conjunct, \\ not: Literal $\to$ Literal, \\ atom: Rel \texttimes{} Sum \texttimes{} Sum $\to$ Literal, \\ embedB: 2 $\to$ Literal, \\ encloseD: Disjunct $\to$ Literal\}
\end{itemize}


\subsubsection{JavaLight' (entlinksrekursiv)}
\label{sec-4-5-2}
\begin{itemize}
\item wird um die Sorten Sumsect und Prodsect erweitert und um die Konstruktoren
\item sum: Prod \texttimes{} Sumsect $\to$ Sum, \\ plus, minus: Prod \texttimes{} Sumsect $\to$ Sumsect, \\ nilS: 1 $\to$ Sumsect, \\ prod: Factor \texttimes{} Prodsect $\to$ Prod, \\ times, div: Factor \texttimes{} Prodsect $\to$ Prodsect, \\ nilP: 1 $\to$ Prodsect
\end{itemize}

\subsubsection{Syntaxbaum Beispiel}
\label{sec-4-5-3}
Beispiel Programm:
\begin{itemize}
\item fact = 1; while x > 1 \{fact = fact*x; x = x-1;\}
\end{itemize}

\begin{tikzpicture}[grow'=right, level distance=0.6in]
\Tree [.Seq 
            [.Assign fact 
                          [.Sum 
                                [.Prod 
                                       [.EmbedI 1 ] 
                                       NilP ]
                                NilS ]]
            [.Embed 
                    [.Loop
                           [.EmbedC 
                                    [.EmbedL 
                                             [.Atom > 
                                                    [.Sum 
                                                          [.Prod 
                                                                 [.Var x ]
                                                                 [.NilP ]]
                                                          [.NilS ]]
                                                    [.Sum 
                                                          [.Prod 
                                                                 [.EmbedI 1 ]
                                                                 [.NilP ]]
                                                          [.NilS ]]]]]
                    [.Block 
                            [.Seq 
                                  [.Assign
                                           fact 
                                           [.Sum 
                                                 [.Prod 
                                                        [.Var fact ]
                                                        [.Times 
                                                                [.Var x ]
                                                                [.NilP ]]]
                                                 [.NilS ]]]
                                  [.Embed 
                                          [.Assign
                                                   x
                                                   [.Sum 
                                                         [.Prod
                                                                [.Var x ]
                                                                [.NilP ]]
                                                         [.Minus 
                                                                 [.Prod
                                                                        [.EmbedI 1 ]
                                                                        [.NilP ]]
                                                                 [.NilS ]]]]]]]]]]
\end{tikzpicture}

\subsection{Definition derec(G)}
\label{sec-4-6}

\begin{itemize}
\item F"ur alle s $\in$ S $\cup$ BS $\backslash$ Z(G), derec(G)$_{\text{s}}$ = T$_{\Sigma\text{(G'),s}}$
\item F"ur alle s $\in$ S $\backslash$ recs(S) und s $\to$ v $\in$ R und t $\in$ T$_{\Sigma\text{(G'),typ(v)}}$, f$_{\text{s }\to\ \text{v}}^{\text{derec(G)}}$(t) = f$_{\text{s }\to\ \text{v}}$(t)
\item F"ur alle s $\to$ v $\in$ nonrecs(R), s $\to$ sw $\in$ R, t $\in$ T$_{\Sigma\text{(G'),typ(v)}}$, t' $\in$ T$_{\Sigma\text{(G'),s'}}$ und u $\in$ T$_{\Sigma\text{(G'), typ(w)}}$ \\ f$_{\text{s }\to\ \text{v}}^{\text{derec(G)}}$(t) = f$_{\text{s }\to\ \text{vs'}}$(t, f$_{\text{s' }\to\ \epsilon}$) \\ f$_{\text{s }\to\ \text{sw}}^{\text{derec(G)}}$(f$_{\text{s }\to\ \text{vs'}}$(t,t'),u) = f$_{\text{s }\to\ \text{vs'}}$(t, f$_{\text{s' }\to\ \text{ws'}}$(u, t'))
\end{itemize}

Mit derec(G) kann man eine Syntaxbaum in G in einen Syntaxbaum der nicht linksrekursiven Grammatik G' umwandeln


\subsection{Wort- und Ableitungsbaumalgebra}
\label{sec-4-7}
Neben T$_{\Sigma\text{(g)}}$ lassen sich auch die Menge der W"orter "uber X und die Menge der Ableitungsb"aume von G zu $\Sigma$(G)-Algebren erweitern.

\subsubsection{Wortalgebra}
\label{sec-4-7-1}
fold$^{\text{Word(G)}}$ bildet Terme auf die entsprechenden W"orter der Sprache. 

\subsubsection{Ableitungsbaumalgebra}
\label{sec-4-7-2}
Bildet auf einen Baum ab, der auch die W"orter darstellt (inklusive der Terminale aus Z(G))

\subsection{Zustandsmodell von JavaLight}
\label{sec-4-8}
\begin{itemize}
\item Sei Store = String $\to$ Z (Variablenbelegung)

\item Wir bilden eine $\Sigma$(JavaLight)-Algebra
\end{itemize}

\subsubsection{Sorten}
\label{sec-4-8-1}
\begin{itemize}
\item A$_{\text{Commands}}$ = A$_{\text{Command}}$ = Store $\to$ Store
\item A$_{\text{Sum}}$ = A$_{\text{Factor}}$ = A$_{\text{Prod}}$ = Store $\to$ Z
\item A$_{\text{Disjunkt}}$ = A$_{\text{Conjunct}}$ = A$_{\text{Literal}}$ = Store $\to$ 2
\end{itemize}
