Zusammenfassung.org
*** Operationen
F"ur alle f,g: Store \to Store, x \in Store, e: Store \in Z, st \in Store \\ und p: Store \to 2.

#+BEGIN_CENTER
seq^A(f, g) = g . f, \\
embed^A(f) = block^A(f) = f, \\
assign^A(x,e)(st) = st[e(st)/x], \\
cond^A(p, f, g)(st) = if p(st) then f(st) else g(st), \\
cond1^A(p, f)(st) = if p(st) then f(st) else st, \\
loop^A(p, f)(st) = if p(st) then loop(p, f)(f(st)) else st. \\
#+END_CENTER

F"ur alle f,g: Store \to Z, x \in String und i \in Z

#+BEGIN_CENTER
sum^A(f) = prod^A(f) = f, \\
plus^A(f, g) = list^Store(+)(f, g) = \lambda st. f(st) + g(st), \\
minus^A(f, g) = list^Store(-)(f, g) = \lambda st. f(st) - g(st), \\
times^A(f, g) = list^Store(*)(f, g) = \lambda st. f(st) * g(st), \\
div^A(f, g) = list^Store(/)(f, g) = \lambda st. f(st) / g(st), \\
embedI(i)(st) = i, \\
var(x)(st) = st(x), \\
encloseS^A(f) = f.
#+END_CENTER

F"ur alle f, g: Store \to 2, rel \in Rel, e, e': Store \to Z, b \in 2,

#+BEGIN_CENTER
disjunct^A(f, g) = lift^Store(\lor)(f,g) = \lambda st. f(st) \lor g(st), \\
conjunct^A(f, g) = lift^Store(\land)(f,g) = \lambda st. f(st) \land g(st), \\
atom^A(rel, e, e') = lift^Store(rel)(e,e') = \lambda st. e(st) rel e'(st), \\
embedC^A(f) = embedL^A(f) = encloseD^A(f) = f, \\
not^A(f) = \not . f, \\
embedB^A(b)(st) = b.
#+END_CENTER

* Parser und Compiler f"ur CFGs

<<diagram_1>>
T_{\Sigma(G)} \xrightarrow{fold^Z} Z \xrightarrow{evaluate} Mach \\
T_{\Sigma(G)} \xrightarrow{fold^S} S \xrightarrow{encode} Mach

- S: Sem, die ebenfalls als \Sigma(G)-Algebra gegebene Semantik der Quellsprache L(G)
- Mach, eine in der Regel unabh"angig von \Sigma(G) definiertes Modell der Zielsprache, meist in der Form einer abstrakten Maschine 
- evaluate, ein Interpreter der die Zielsprache in der abstrakten Maschine Mach ausf"uhrt
- encode, eine Funktion, die Sem auf Mach abbildet und die gew"unschte Arbeitsweise des Compilers auf der semantischen Ebene ausf"uhrt

** Definition Parser

Parser f"ur G: eine S-sortige Funktion
#+BEGIN_CENTER
parse_G: X^{*} \to M(T_{\Sigma(G)})
#+END_CENTER
die entweder einen Synatxbaum f"ur das Eingabewort erzeugt oder eine Fehlermeldung zur"uck gibt. (Syntaxbaum und Fehlermeldung sind abh"anig von der Monade M)

** Funktoren und Monaden

*** Definition Kategorie
Eine Kategorie K besteht aus
- einer - ebenfalls mit K bezeichneten- Klasse von K-Objekten 
- f"ur alle A.B \in K einer Menge K(A,B) von K-Morphismen
- einer assoziativen Komposition 
#+BEGIN_CENTER 
. : K(A,B) \times K(B, C) \to K(A,C) 
\\ (f,g) \to g . f 
#+END_CENTER 
- einer Identit"at id_A \in K(A,A), die bez"uglich . neutral ist

*** Defintion Funktor 
Seien K und L Kategorien. Ein Funktor F: K \to L ist eine Funktion(m"ussen das wirklich Funktionen sein?), die jedem K-Objekt ein L-Objekt und jedem 
K-Morphismus f: A \to B eine L-Morphismus F(f): F(A) \to F(B)  zuordnet, sowie folgende Gleichungen erf"ullt:
- F"ur alle K-Objekte A, F(id_A) = id_{F(A)}
- F"ur alle K-Morphismen f: A \to B und g: B \to C, F(g . f) = F(g) . F(f)
- Funktoren lassen sich wie Funktionen zu neuen Funktoren komponieren. 

**** Beispiele
- Sei B \in L. Der konstante Funktor const(B): K \to L ordnet jedem K-Objekt B und jedem K-Morphismus die Identit"at auf B zu
- Der Diagonalfunktor \Delta_K: K \to K^2 ordnet jedem K-Objekt A das Paar (A,A) und jedem K-Morphismus f das Paar (f,f) zu
- Produktfunktor, _ \times _ : Set^2 \to Set ordnet jedem Mengenpaar (A,B) die Menge A \times B und jedem Funktionspaar (f: A \to B, g: C \to D) die Funktion f \times g =_def \lambda(a,c).(f(a),g(c)) zu
- Ausnahmefunktor _ + E : Set \to Set ordnet jeder Menge A die Menge A + E zu und jeder Funktion f: A \to B die Funktion 
#+BEGIN_CENTER
f + E: A + E \to B + E \\
(a, 1) \to (f(a), 1) \\
(e, 2) \to (e, 2) \\
#+END_CENTER

*** Definition Nat"urliche Transformation 
Seien F, G: K \to L Funktoren. Eine nat"urliche Transformation \tau: F \to G ordnet jedem K-Objekt A einen L-Morphismus \tau_A: F(A) 
\to G(A) derart, dass f"ur alle K-Morphismen f:A \to B das gilt:

- F(A) \to^{\tau_A} G(A)
- F(A) \to^{F(f)} F(B)
- F(B) \to^{\tau_B} G(B)
- G(A) \to^{G(f)} G(B)

*** Definition Monade 
Ein Funktor M: K \to K hei"st Monade, wenn es zwei nat"urliche Transformationen \eta: Id_K \to M (Einheit) und \mu: M . M \to M 
(Multiplikation) gibt, die f"ur alle A \in K folgednes gelten lassen:

- Seite 154 Folienscript

**** Beispiel Ausnahmefunktor

- \eta_A: A \to A + E \\ \eta_A(a) = (a,1)
- \mu_A: (A + E) + E \\ \mu_A( ((a,1),1) ) = (a,1) \\ \mu_A( ((e,2),1) ) = (e,2) \\ \mu_A( (e,2) ) = (e,2)

**** Der bind-Operator
Seien A und B Mengen

#+BEGIN_CENTER
>>=: M(A) \times (A \to M(B)) \to M(B) \\
(>>= f) = \mu_B . M(f)
#+END_CENTER

**** Intuitive Erkl"arung einer Monade 

Intuitiv stellt man sich ein monadisches Object m \in M(A) als Berechnung vor, die eine -evt leere- Menge von Werten in A erzeugt. 
Ein Ausdruck der Form />>= f/ wird dann wie folgt ausgewertet: Die von m berechneten Werte a \in A werden als Eingabe an die Berechnung
von f "ubergeben und von f(a) verarbeitet.

**** Es ergeben sich ein paar Eigenschaften
- m >>= \eta_A = m
- \eta_A(a) >>= f = f(a)
- (m >>= f) >>= g = m >>= \lambda a. f(a) >>= g
- M(h)(m) = m >>= \mu_B . h
- \eta_A(m') = m' >>= id_M(A)

**** Plusmonade
Plusmonaden haben zus"atzlich eine parallele *Komposition*
#+BEGIN_CENTER
\oplus: M \times M =_def _ \times _ . \Delta . M \to M
#+END_CENTER

*** Compilermonade
Sei M: Set^S \to Set^S eine Monade mit der Einheit \eta, bind-Operator >>= und paralleler Komposition \oplus, set: M \to P eine 
weitere nat"urliche Transformation und 
#+BEGIN_CENTER
E = {m \in M(A) | set_A(m) = \emptyset, A \in Set^S}
#+END_CENTER
"Menge der Ausnahmewerte" \\

M hei"st Compilermonade, wenn f"ur alle Mengen A und B, m, m', m'' \in M(A), e \in E, f: A \to M(B), h: A \to B und a \in A Folgendes gilt:
#+BEGIN_CENTER
(m \oplus m') \oplus m'' = m \oplus (m' \oplus m'') \\
M(h)(e) = e \\
M(h)(m \oplus m') = M(h)(m) \oplus M(h)(m') \\
set_A(m \oplus m') = set_A(m) \cup set_A(m') \\
set_A(\eta_A(a)) = {a} \\
set_B(m >>= f) = \cup{set_B(f(a)) | a \in set_A(m)}
#+END_CENTER

