Zusammenfassung.tex

\subsubsection{Operationen}
\label{sec-4-8-2}
F"ur alle f,g: Store $\to$ Store, x $\in$ Store, e: Store $\in$ Z, st $\in$ Store \\ und p: Store $\to$ 2.

\begin{center}
seq$^{\text{A}}$(f, g) = g . f, \\
embed$^{\text{A}}$(f) = block$^{\text{A}}$(f) = f, \\
assign$^{\text{A}}$(x,e)(st) = st[e(st)/x], \\
cond$^{\text{A}}$(p, f, g)(st) = if p(st) then f(st) else g(st), \\
cond1$^{\text{A}}$(p, f)(st) = if p(st) then f(st) else st, \\
loop$^{\text{A}}$(p, f)(st) = if p(st) then loop(p, f)(f(st)) else st. \\
\end{center}

F"ur alle f,g: Store $\to$ Z, x $\in$ String und i $\in$ Z

\begin{center}
sum$^{\text{A}}$(f) = prod$^{\text{A}}$(f) = f, \\
plus$^{\text{A}}$(f, g) = list$^{\text{Store}}$(+)(f, g) = $\lambda$ st. f(st) + g(st), \\
minus$^{\text{A}}$(f, g) = list$^{\text{Store}}$(-)(f, g) = $\lambda$ st. f(st) - g(st), \\
times$^{\text{A}}$(f, g) = list$^{\text{Store}}$(*)(f, g) = $\lambda$ st. f(st) * g(st), \\
div$^{\text{A}}$(f, g) = list$^{\text{Store}}$(/)(f, g) = $\lambda$ st. f(st) / g(st), \\
embedI(i)(st) = i, \\
var(x)(st) = st(x), \\
encloseS$^{\text{A}}$(f) = f.
\end{center}

F"ur alle f, g: Store $\to$ 2, rel $\in$ Rel, e, e': Store $\to$ Z, b $\in$ 2,

\begin{center}
disjunct$^{\text{A}}$(f, g) = lift$^{\text{Store}}$($\lor$)(f,g) = $\lambda$ st. f(st) $\lor$ g(st), \\
conjunct$^{\text{A}}$(f, g) = lift$^{\text{Store}}$($\land$)(f,g) = $\lambda$ st. f(st) $\land$ g(st), \\
atom$^{\text{A}}$(rel, e, e') = lift$^{\text{Store}}$(rel)(e,e') = $\lambda$ st. e(st) rel e'(st), \\
embedC$^{\text{A}}$(f) = embedL$^{\text{A}}$(f) = encloseD$^{\text{A}}$(f) = f, \\
not$^{\text{A}}$(f) = \textlnot{} . f, \\
embedB$^{\text{A}}$(b)(st) = b.
\end{center}

\section{Parser und Compiler f"ur CFGs}
\label{sec-5}

\label{diagram_1}
T$_{\Sigma\text{(G)}}$ \xrightarrow{fold^Z} Z \xrightarrow{evaluate} Mach \\
T$_{\Sigma\text{(G)}}$ \xrightarrow{fold^S} S \xrightarrow{encode} Mach

\begin{itemize}
\item S: Sem, die ebenfalls als $\Sigma$(G)-Algebra gegebene Semantik der Quellsprache L(G)
\item Mach, eine in der Regel unabh"angig von $\Sigma$(G) definiertes Modell der Zielsprache, meist in der Form einer abstrakten Maschine
\item evaluate, ein Interpreter der die Zielsprache in der abstrakten Maschine Mach ausf"uhrt
\item encode, eine Funktion, die Sem auf Mach abbildet und die gew"unschte Arbeitsweise des Compilers auf der semantischen Ebene ausf"uhrt
\end{itemize}

\subsection{Definition Parser}
\label{sec-5-1}

Parser f"ur G: eine S-sortige Funktion
\begin{center}
parse$_{\text{G}}$: X$^{\text{*}}$ $\to$ M(T$_{\Sigma\text{(G)}}$)
\end{center}
die entweder einen Synatxbaum f"ur das Eingabewort erzeugt oder eine Fehlermeldung zur"uck gibt. (Syntaxbaum und Fehlermeldung sind abh"anig von der Monade M)

\subsection{Funktoren und Monaden}
\label{sec-5-2}

\subsubsection{Definition Kategorie}
\label{sec-5-2-1}
Eine Kategorie K besteht aus
\begin{itemize}
\item einer - ebenfalls mit K bezeichneten- Klasse von K-Objekten
\item f"ur alle A.B $\in$ K einer Menge K(A,B) von K-Morphismen
\item einer assoziativen Komposition
\end{itemize}
\begin{center}
. : K(A,B) \texttimes{} K(B, C) $\to$ K(A,C) 
\\ (f,g) $\to$ g . f 
\end{center}
\begin{itemize}
\item einer Identit"at id$_{\text{A}}$ $\in$ K(A,A), die bez"uglich . neutral ist
\end{itemize}

\subsubsection{Defintion Funktor}
\label{sec-5-2-2}
Seien K und L Kategorien. Ein Funktor F: K $\to$ L ist eine Funktion(m"ussen das wirklich Funktionen sein?), die jedem K-Objekt ein L-Objekt und jedem 
K-Morphismus f: A $\to$ B eine L-Morphismus F(f): F(A) $\to$ F(B)  zuordnet, sowie folgende Gleichungen erf"ullt:
\begin{itemize}
\item F"ur alle K-Objekte A, F(id$_{\text{A}}$) = id$_{\text{F(A)}}$
\item F"ur alle K-Morphismen f: A $\to$ B und g: B $\to$ C, F(g . f) = F(g) . F(f)
\item Funktoren lassen sich wie Funktionen zu neuen Funktoren komponieren.
\end{itemize}

\begin{enumerate}
\item Beispiele
\label{sec-5-2-2-1}
\begin{itemize}
\item Sei B $\in$ L. Der konstante Funktor const(B): K $\to$ L ordnet jedem K-Objekt B und jedem K-Morphismus die Identit"at auf B zu
\item Der Diagonalfunktor $\Delta$$_{\text{K}}$: K $\to$ K$^{\text{2}}$ ordnet jedem K-Objekt A das Paar (A,A) und jedem K-Morphismus f das Paar (f,f) zu
\item Produktfunktor, \_ \texttimes{} \_ : Set$^{\text{2}}$ $\to$ Set ordnet jedem Mengenpaar (A,B) die Menge A \texttimes{} B und jedem Funktionspaar (f: A $\to$ B, g: C $\to$ D) die Funktion f \texttimes{} g =$_{\text{def}}$ $\lambda$(a,c).(f(a),g(c)) zu
\item Ausnahmefunktor \_ + E : Set $\to$ Set ordnet jeder Menge A die Menge A + E zu und jeder Funktion f: A $\to$ B die Funktion
\end{itemize}
\begin{center}
f + E: A + E $\to$ B + E \\
(a, 1) $\to$ (f(a), 1) \\
(e, 2) $\to$ (e, 2) \\
\end{center}
\end{enumerate}

\subsubsection{Definition Nat"urliche Transformation}
\label{sec-5-2-3}
Seien F, G: K $\to$ L Funktoren. Eine nat"urliche Transformation $\tau$: F $\to$ G ordnet jedem K-Objekt A einen L-Morphismus $\tau$$_{\text{A}}$: F(A) 
$\to$ G(A) derart, dass f"ur alle K-Morphismen f:A $\to$ B das gilt:

\begin{itemize}
\item F(A) $\to$$^{\tau_{\text{A}}}$ G(A)
\item F(A) $\to$$^{\text{F(f)}}$ F(B)
\item F(B) $\to$$^{\tau_{\text{B}}}$ G(B)
\item G(A) $\to$$^{\text{G(f)}}$ G(B)
\end{itemize}

\subsubsection{Definition Monade}
\label{sec-5-2-4}
Ein Funktor M: K $\to$ K hei"st Monade, wenn es zwei nat"urliche Transformationen $\eta$: Id$_{\text{K}}$ $\to$ M (Einheit) und $\mu$: M . M $\to$ M 
(Multiplikation) gibt, die f"ur alle A $\in$ K folgednes gelten lassen:

\begin{itemize}
\item Seite 154 Folienscript
\end{itemize}

\begin{enumerate}
\item Beispiel Ausnahmefunktor
\label{sec-5-2-4-1}

\begin{itemize}
\item $\eta$$_{\text{A}}$: A $\to$ A + E \\ $\eta$$_{\text{A}}$(a) = (a,1)
\item $\mu$$_{\text{A}}$: (A + E) + E \\ $\mu$$_{\text{A}}$( ((a,1),1) ) = (a,1) \\ $\mu$$_{\text{A}}$( ((e,2),1) ) = (e,2) \\ $\mu$$_{\text{A}}$( (e,2) ) = (e,2)
\end{itemize}

\item Der bind-Operator
\label{sec-5-2-4-2}
Seien A und B Mengen

\begin{center}
>>=: M(A) \texttimes{} (A $\to$ M(B)) $\to$ M(B) \\
(>>= f) = $\mu$$_{\text{B}}$ . M(f)
\end{center}

\item Intuitive Erkl"arung einer Monade
\label{sec-5-2-4-3}

Intuitiv stellt man sich ein monadisches Object m $\in$ M(A) als Berechnung vor, die eine -evt leere- Menge von Werten in A erzeugt. 
Ein Ausdruck der Form \emph{>>= f} wird dann wie folgt ausgewertet: Die von m berechneten Werte a $\in$ A werden als Eingabe an die Berechnung
von f "ubergeben und von f(a) verarbeitet.

\item Es ergeben sich ein paar Eigenschaften
\label{sec-5-2-4-4}
\begin{itemize}
\item m >>= $\eta$$_{\text{A}}$ = m
\item $\eta$$_{\text{A}}$(a) >>= f = f(a)
\item (m >>= f) >>= g = m >>= $\lambda$ a. f(a) >>= g
\item M(h)(m) = m >>= $\mu$$_{\text{B}}$ . h
\item $\eta$$_{\text{A}}$(m') = m' >>= id$_{\text{M}}$(A)
\end{itemize}

\item Plusmonade
\label{sec-5-2-4-5}
Plusmonaden haben zus"atzlich eine parallele \textbf{Komposition}
\begin{center}
$\oplus$: M \texttimes{} M =$_{\text{def}}$ \_ \texttimes{} \_ . $\Delta$ . M $\to$ M
\end{center}
\end{enumerate}

\subsubsection{Compilermonade}
\label{sec-5-2-5}
Sei M: Set$^{\text{S}}$ $\to$ Set$^{\text{S}}$ eine Monade mit der Einheit $\eta$, bind-Operator >>= und paralleler Komposition $\oplus$, set: M $\to$ P eine 
weitere nat"urliche Transformation und 
\begin{center}
E = \{m $\in$ M(A) | set$_{\text{A}}$(m) = $\emptyset$, A $\in$ Set$^{\text{S}}$\}
\end{center}
"Menge der Ausnahmewerte" \\

M hei"st Compilermonade, wenn f"ur alle Mengen A und B, m, m', m'' $\in$ M(A), e $\in$ E, f: A $\to$ M(B), h: A $\to$ B und a $\in$ A Folgendes gilt:
\begin{center}
(m $\oplus$ m') $\oplus$ m'' = m $\oplus$ (m' $\oplus$ m'') \\
M(h)(e) = e \\
M(h)(m $\oplus$ m') = M(h)(m) $\oplus$ M(h)(m') \\
set$_{\text{A}}$(m $\oplus$ m') = set$_{\text{A}}$(m) $\cup$ set$_{\text{A}}$(m') \\
set$_{\text{A}}$($\eta$$_{\text{A}}$(a)) = \{a\} \\
set$_{\text{B}}$(m >>= f) = $\cup$\{set$_{\text{B}}$(f(a)) | a $\in$ set$_{\text{A}}$(m)\}
\end{center}
