Zusammenfassung.org
*** Monadenbasierte Parser und Compiler 

- Sei G = (S, BS, R) LL-kompilierbar 
- G' die daraus gebildete nicht-linksrekursive Grammatik 
- X = \cup BS
- \Sigma(G) = (S, F)
- M : Set^S \to Set^S

Ein Compiler f"ur G in die als \Sigma(G)-Algebra A formulierte Zielsprache einen Parser f"ur G mit der Faltung in A der vom Parser 
erzeugten Syntaxbaume komponieren.
Daher passen wir die "Ubersetzungsfunktion ein bisschen an:

<<compile_funktion>>
#+BEGIN_CENTER
compile_G^A = X^{*} \to^{compile_G^{T_{\Sigma(G)}}} M(T_{\Sigma(G)}) \to^{M(fold_A)} M(A)
#+END_CENTER

Ist G linksrekursiv terminiert das evt nicht, daher fordern wir in dem Fall:

#+BEGIN_CENTER
compile_G^A = X^{*} \to^{parse_G^{T_{\Sigma(G)}}} M(T_{\Sigma(G')}) \to^{M(fold_{derec(A))}} M(A)
#+END_CENTER

Es gilt die Vertr"aglichkeit mit \Sigma-Homomorphismen (eingebettet in die Monade nat"urlich)

Gilt [[compile_funktion]], dann folgt aus [[diagram_1]]: 
- X^{*} \to^{compile_G^A} M(A) \to^{M(evaluate)} M(Mach) \\
- X^{*} \to^{compile_G^S} M(S) \to^{M(encode)} M(Mach)
 

* LL Kompiler

Das erste L steht f"ur die Verarbeitung von *Links* nach Rechts. Das zweite L steht f"ur das bilden einer *Linksableitung*.

- G = (S, BS, R)
- G' = (S', BS, R')
- X = \cup BS 
- M eine Compilermonade
- errmsg: X^{*} \to E
- A = (A, Op) eine \Sigma(G)-Algebra
- /compile_G/ hei"st LL-Compiler, wenn (compile^A_{G,s}: X^{*} \to M(A_s))_{s\[ \in \]S} 
- compile_{G,s}^A(w) = trans_s^A(w) >>= \lambda(a, w). if w = \epsilon then \eta_A(a) else errmsg(w), wobei f"ur alle s \in S' \cup BS \\ trans_s^A : X^{*} \to M(A_s \times X^{*}) wie folgt definiert ist:

** Fall 1: s \in BS. F"ur alle x \in X und w \in X^{*}

#+BEGIN_CENTER
trans_s^A(xw) = if x \in s then \eta_{A \times X^{*}}(x,w) else errmsg(xw) \\
trans_s^A(\epsilon) = errmsg(\epsilon)
#+END_CENTER

** Fall 2: s \in S'. F"ur alle w \in X^{*},

#+BEGIN_CENTER
trans_s^A(w) = \oplus_{r=(s \to e)\in R} try_r^A(w)
#+END_CENTER


F"ur alle r = (s \to (e_1,..,e_n))\in R' und w \in X^{*},
#+BEGIN_CENTER
try_r^A(w) = trans_{e_1}^A >>= \lambda(a_1,w_1). ...... trans_{e_n}^A(w_{n-1}) >>= \lambda(a_n, w_n).\eta_{A \times X^{*}}(f_r^{derec(A)}(a_{i_1},..,a_{i_k}),w_n)
#+END_CENTER
wobei {i_1,..,i_k} = {1 \leq i \leq n | e_i \in S' \cup BS \ Z(G)} \\


*_Ein Beispiel ist auf Seite 170 im Folienscript. Das JavaLight+ Beispiel beginnt auf Seite 172_* 

* LR Kompiler

- Konstruieren *Rechtsreduktion* (\Rightarrow Rechtsableitung)
- Entspricht dem /mit dem Bl"attern beginnender Aufbau eines Syntaxbaumes/, daher *Bottom-up* Compiler
- LR-Compiler sind auf LR(/k/)-Grammatiken beschr"ankt
- Sei G = (S, BS, R) eine CFG und X = \cup BS
- Vorraussetzung: /start/ \in S und /start/ kommt in keiner Regel auf der rechten Seite vor

** LR(k) Grammatiken 
Eine Grammatik ist eine LR(k) Grammatik, wenn das vorrauslesen von k Symbolen reicht, damit man entscheiden kann ob ein weiteres 
Zeichen gelesen werden muss oder eine Reduktion durchgef"uhrt werden muss (und wenn ja welche). Au"serdem m"ussen die BS disjunkt sein.

*** Definition first- und follow- Wormengen
Sei k > 0, \alpha \in (S \cup BS)^{*} und s \in S
#+BEGIN_CENTER
first_k(\alpha) = {\beta \in BS^{k} | \exists \gamma \in BS^{*}: \alpha \to^{*}_G \beta\gamma} \cup {\beta \in BS^{<k} | \alpha \to^{*}_G \beta}
follow_k(s) = {\beta \in BS^{k} | \exists \alpha, \gamma \in BS^{*}: start \to^{*}_G \alpha s \beta\gamma} \cup {\alpha \in BS^{<k} | start \to^{*}_G \alpha s \beta}
first(\alpha) = first_1(\alpha)
follow(s) = follow_1(s)
#+END_CENTER  

Sei recog_1 ein Erkenner f"ur die Sprache (Definition auf Seite 190)

** LR-Automat
Zustandsmenge:
- Q_G = {state(\phi) | \phi \in (S \cup BS)^{*}}

/partielle/ Transitionsfunktion (auch goto-Tabelle genannt) 
- \delta: Q_G \to Q_G^{S \cup BS} \\ state(\phi) = \lambda(s).state(\phi s)

*** Simultane induktive Definition von Q_G und \delta_G
#+BEGIN_CENTER
start \to \alpha \in R \Rightarrow (start, \epsilon, \alpha, \epsilon) \in q_0 \\
(s, \alpha, s', \beta, u) \in q \land s' \to \gamma \in R \land v \in first(\beta u) \Rightarrow (s', \epsilon, \gamma, v) \in q \\
(s, \alpha, s'\beta, u) \in q, s' \in S \cup BS \Rightarrow (s, \alpha s', \beta, u) \in \delta_G(q)(s')
#+END_CENTER

- h: (S \cup BS)^{*} \to Q^{*}_G
- state(\epsilon) =_def \lambda(\epsilon). q_0
- \lambda(s_1,..,s_n). (state(s_1...s_n), state(s_1...s_{n-1}),.., state(s_1), state(\epsilon))


Wir definieren recog_2: Q^{*}_G \to 2^{X^{*}} \\
F"ur alle q, q_i \in Q_G, qs \in Q^{*}_G, x \in X und w \in X^{*},
- recog_2(q:qs)(xw) = recog_2(\delta_G(q)(x):q:qs)(w) \\ falls \exists (s, \alpha, \beta, \epsilon) \in q : \beta \neq \epsilon, x \in first(\beta) \cap Z(G)
- recog_2(q:qs)(xw) = recog_2(\delta_G(q)(B):q:qs)(w) \\ falls \exists (s, \alpha, \beta, \epsilon) \in q, B \in BS: \\ \beta \neq \epsilon, x \in B \in first(\beta)
- recog_2(q_1: ... :q_{|\alpha|}:q:qs)(w) = recog_2(\delta_G(q)(s):q:qs)(w) \\ falls \exists (s, \alpha, \epsilon u) \in q_1:s \neq start, \\ w = \epsilon = u \lor head(w) = u \in Z(G) \lor \\ head(w) \in u \in BS
- recog_2(q:qs)(\epsilon) = 1 falls \exists \varphi : (start, \varphi, \epsilon, \epsilon) \in q
- recog_2(qs)(w) = 0 sonst

Offenbar gilt recog_1 = recog_2 \bigcirc h.

Zur optimieren verwenden wir eine Aktionstabelle 
- act_G: Q_G \times (BS \cup 1) \to R \cup {shift, error}
F"ur alle u \in BS \cup,

- act_G(q, u) = shift falls \exists (s, \alpha, \beta, \epsilon) \in q: \beta \neq \epsilon, u \in first(\beta), \\ s \to \alpha falls \exists (s, \alpha, \epsilon u) \in q, \\ /error/ sonst

Dann erh"alt man eine Kompaktedefinition f"ur recog_2:

F"ur alle q, q_i \in Q_G, qs \in Q^{*}_G, x \in X und w \in X^{*},
- recog_2(q:qs)(xw) = recog_2(\delta_G(q)(x):q:qs)(w) \\ falls x \in Z(G), act_G(q, x) = shift
- recog_2(q:qs)(xw) = recog_2(\delta_G(q)(B):q:qs)(w) \\ falls \exists B \in BS : x \in B, act_G(q, B) = shift
- recog_2(q_1:...:q_{|\alpha|}:q:qs)(w) = recog_2(\delta_G(q)(s):q:qs)(w) \\ falls \exists u \in BS \cup 1: act_G(q_1, u) = s \to \alpha,\\ w = \epsilon = u \lor head(w) = u \in Z(G) \lor \\ head(w) \in u \in BS
- recog_2(q:qs)(\epsilon) = 1 falls act_G(q, \epsilon) = start \to \alpha
- recog_2(qs)(w) = 0 sonst

Beispiel f"ur SAB2 auf Seite 197 im Skript.

