Zusammenfassung.tex

\subsubsection{Monadenbasierte Parser und Compiler}
\label{sec-5-2-6}

\begin{itemize}
\item Sei G = (S, BS, R) LL-kompilierbar
\item G' die daraus gebildete nicht-linksrekursive Grammatik
\item X = $\cup$ BS
\item $\Sigma$(G) = (S, F)
\item M : Set$^{\text{S}}$ $\to$ Set$^{\text{S}}$
\end{itemize}

Ein Compiler f"ur G in die als $\Sigma$(G)-Algebra A formulierte Zielsprache einen Parser f"ur G mit der Faltung in A der vom Parser 
erzeugten Syntaxbaume komponieren.
Daher passen wir die "Ubersetzungsfunktion ein bisschen an:

\label{compile_funktion}
\begin{center}
compile$_{\text{G}}^{\text{A}}$ = X$^{\text{*}}$ $\to$$^{\text{compile}_{\text{G}}^{\text{T}_{\Sigma\text{(G)}}}}$ M(T$_{\Sigma\text{(G)}}$) $\to$$^{\text{M(fold}_{\text{A}}\text{)}}$ M(A)
\end{center}

Ist G linksrekursiv terminiert das evt nicht, daher fordern wir in dem Fall:

\begin{center}
compile$_{\text{G}}^{\text{A}}$ = X$^{\text{*}}$ $\to$$^{\text{parse}_{\text{G}}^{\text{T}_{\Sigma\text{(G)}}}}$ M(T$_{\Sigma\text{(G')}}$) $\to$$^{\text{M(fold}_{\text{derec(A))}}}$ M(A)
\end{center}

Es gilt die Vertr"aglichkeit mit $\Sigma$-Homomorphismen (eingebettet in die Monade nat"urlich)

Gilt \ref{compile_funktion}, dann folgt aus \ref{diagram_1}: 
\begin{itemize}
\item X$^{\text{*}}$ $\to$$^{\text{compile}_{\text{G}}^{\text{A}}}$ M(A) $\to$$^{\text{M(evaluate)}}$ M(Mach) \\
\item X$^{\text{*}}$ $\to$$^{\text{compile}_{\text{G}}^{\text{S}}}$ M(S) $\to$$^{\text{M(encode)}}$ M(Mach)
\end{itemize}


\section{LL Kompiler}
\label{sec-6}

Das erste L steht f"ur die Verarbeitung von \textbf{Links} nach Rechts. Das zweite L steht f"ur das bilden einer \textbf{Linksableitung}.

\begin{itemize}
\item G = (S, BS, R)
\item G' = (S', BS, R')
\item X = $\cup$ BS
\item M eine Compilermonade
\item errmsg: X$^{\text{*}}$ $\to$ E
\item A = (A, Op) eine $\Sigma$(G)-Algebra
\item \emph{compile$_{\text{G}}$} hei"st LL-Compiler, wenn (compile$^{\text{A}}_{\text{G,s}}$: X$^{\text{*}}$ $\to$ M(A$_{\text{s}}$))$_{\text{s} \in \text{S}}$
\item compile$_{\text{G,s}}^{\text{A}}$(w) = trans$_{\text{s}}^{\text{A}}$(w) >>= $\lambda$(a, w). if w = $\epsilon$ then $\eta$$_{\text{A}}$(a) else errmsg(w), wobei f"ur alle s $\in$ S' $\cup$ BS \\ trans$_{\text{s}}^{\text{A}}$ : X$^{\text{*}}$ $\to$ M(A$_{\text{s}}$ \texttimes{} X$^{\text{*}}$) wie folgt definiert ist:
\end{itemize}

\subsection{Fall 1: s $\in$ BS. F"ur alle x $\in$ X und w $\in$ X$^{\text{*}}$}
\label{sec-6-1}

\begin{center}
trans$_{\text{s}}^{\text{A}}$(xw) = if x $\in$ s then $\eta$$_{\text{A }\texttimes{}\ \text{X}^{\text{*}}}$(x,w) else errmsg(xw) \\
trans$_{\text{s}}^{\text{A}}$($\epsilon$) = errmsg($\epsilon$)
\end{center}

\subsection{Fall 2: s $\in$ S'. F"ur alle w $\in$ X$^{\text{*}}$,}
\label{sec-6-2}

\begin{center}
trans$_{\text{s}}^{\text{A}}$(w) = $\oplus$$_{\text{r=(s }\to\ \text{e)}\in\ \text{R}}$ try$_{\text{r}}^{\text{A}}$(w)
\end{center}


F"ur alle r = (s $\to$ (e$_{\text{1}}$,..,e$_{\text{n}}$))$\in$ R' und w $\in$ X$^{\text{*}}$,
\begin{center}
try$_{\text{r}}^{\text{A}}$(w) = trans$_{\text{e}_{\text{1}}}^{\text{A}}$ >>= $\lambda$(a$_{\text{1}}$,w$_{\text{1}}$). \ldots{}\ldots{} trans$_{\text{e}_{\text{n}}}^{\text{A}}$(w$_{\text{n-1}}$) >>= $\lambda$(a$_{\text{n}}$, w$_{\text{n}}$).$\eta$$_{\text{A }\texttimes{}\ \text{X}^{\text{*}}}$(f$_{\text{r}}^{\text{derec(A)}}$(a$_{\text{i}_{\text{1}}}$,..,a$_{\text{i}_{\text{k}}}$),w$_{\text{n}}$)
\end{center}
wobei \{i$_{\text{1}}$,..,i$_{\text{k}}$\} = \{1 $\le$ i $\le$ n | e$_{\text{i}}$ $\in$ S' $\cup$ BS $\backslash$ Z(G)\} \\


\textbf{\uline{Ein Beispiel ist auf Seite 170 im Folienscript. Das JavaLight+ Beispiel beginnt auf Seite 172}} 

\section{LR Kompiler}
\label{sec-7}

\begin{itemize}
\item Konstruieren \textbf{Rechtsreduktion} ($\Rightarrow$ Rechtsableitung)
\item Entspricht dem \emph{mit dem Bl"attern beginnender Aufbau eines Syntaxbaumes}, daher \textbf{Bottom-up} Compiler
\item LR-Compiler sind auf LR(\emph{k})-Grammatiken beschr"ankt
\item Sei G = (S, BS, R) eine CFG und X = $\cup$ BS
\item Vorraussetzung: \emph{start} $\in$ S und \emph{start} kommt in keiner Regel auf der rechten Seite vor
\end{itemize}

\subsection{LR(k) Grammatiken}
\label{sec-7-1}
Eine Grammatik ist eine LR(k) Grammatik, wenn das vorrauslesen von k Symbolen reicht, damit man entscheiden kann ob ein weiteres 
Zeichen gelesen werden muss oder eine Reduktion durchgef"uhrt werden muss (und wenn ja welche). Au"serdem m"ussen die BS disjunkt sein.

\subsubsection{Definition first- und follow- Wormengen}
\label{sec-7-1-1}
Sei k > 0, $\alpha$ $\in$ (S $\cup$ BS)$^{\text{*}}$ und s $\in$ S
\begin{center}
first$_{\text{k}}$($\alpha$) = \{$\beta$ $\in$ BS$^{\text{k}}$ | $\exists$ $\gamma$ $\in$ BS$^{\text{*}}$: $\alpha$ $\to$$^{\text{*}}_{\text{G}}$ $\beta$$\gamma$\} $\cup$ \{$\beta$ $\in$ BS$^{\text{<k}}$ | $\alpha$ $\to$$^{\text{*}}_{\text{G}}$ $\beta$\}
follow$_{\text{k}}$(s) = \{$\beta$ $\in$ BS$^{\text{k}}$ | $\exists$ $\alpha$, $\gamma$ $\in$ BS$^{\text{*}}$: start $\to$$^{\text{*}}_{\text{G}}$ $\alpha$ s $\beta$$\gamma$\} $\cup$ \{$\alpha$ $\in$ BS$^{\text{<k}}$ | start $\to$$^{\text{*}}_{\text{G}}$ $\alpha$ s $\beta$\}
first($\alpha$) = first$_{\text{1}}$($\alpha$)
follow(s) = follow$_{\text{1}}$(s)
\end{center}

Sei recog$_{\text{1}}$ ein Erkenner f"ur die Sprache (Definition auf Seite 190)

\subsection{LR-Automat}
\label{sec-7-2}
Zustandsmenge:
\begin{itemize}
\item Q$_{\text{G}}$ = \{state($\phi$) | $\phi$ $\in$ (S $\cup$ BS)$^{\text{*}}$\}
\end{itemize}

\emph{partielle} Transitionsfunktion (auch goto-Tabelle genannt) 
\begin{itemize}
\item $\delta$: Q$_{\text{G}}$ $\to$ Q$_{\text{G}}^{\text{S }\cup\ \text{BS}}$ \\ state($\phi$) = $\lambda$(s).state($\phi$ s)
\end{itemize}

\subsubsection{Simultane induktive Definition von Q$_{\text{G}}$ und $\delta$$_{\text{G}}$}
\label{sec-7-2-1}
\begin{center}
start $\to$ $\alpha$ $\in$ R $\Rightarrow$ (start, $\epsilon$, $\alpha$, $\epsilon$) $\in$ q$_{\text{0}}$ \\
(s, $\alpha$, s', $\beta$, u) $\in$ q $\land$ s' $\to$ $\gamma$ $\in$ R $\land$ v $\in$ first($\beta$ u) $\Rightarrow$ (s', $\epsilon$, $\gamma$, v) $\in$ q \\
(s, $\alpha$, s'$\beta$, u) $\in$ q, s' $\in$ S $\cup$ BS $\Rightarrow$ (s, $\alpha$ s', $\beta$, u) $\in$ $\delta$$_{\text{G}}$(q)(s')
\end{center}

\begin{itemize}
\item h: (S $\cup$ BS)$^{\text{*}}$ $\to$ Q$^{\text{*}}_{\text{G}}$
\item state($\epsilon$) =$_{\text{def}}$ $\lambda$($\epsilon$). q$_{\text{0}}$
\item $\lambda$(s$_{\text{1}}$,..,s$_{\text{n}}$). (state(s$_{\text{1}}$\ldots{}s$_{\text{n}}$), state(s$_{\text{1}}$\ldots{}s$_{\text{n-1}}$),.., state(s$_{\text{1}}$), state($\epsilon$))
\end{itemize}


Wir definieren recog$_{\text{2}}$: Q$^{\text{*}}_{\text{G}}$ $\to$ 2$^{\text{X}^{\text{*}}}$ \\
F"ur alle q, q$_{\text{i}}$ $\in$ Q$_{\text{G}}$, qs $\in$ Q$^{\text{*}}_{\text{G}}$, x $\in$ X und w $\in$ X$^{\text{*}}$,
\begin{itemize}
\item recog$_{\text{2}}$(q:qs)(xw) = recog$_{\text{2}}$($\delta$$_{\text{G}}$(q)(x):q:qs)(w) \\ falls $\exists$ (s, $\alpha$, $\beta$, $\epsilon$) $\in$ q : $\beta$ $\neq$ $\epsilon$, x $\in$ first($\beta$) $\cap$ Z(G)
\item recog$_{\text{2}}$(q:qs)(xw) = recog$_{\text{2}}$($\delta$$_{\text{G}}$(q)(B):q:qs)(w) \\ falls $\exists$ (s, $\alpha$, $\beta$, $\epsilon$) $\in$ q, B $\in$ BS: \\ $\beta$ $\neq$ $\epsilon$, x $\in$ B $\in$ first($\beta$)
\item recog$_{\text{2}}$(q$_{\text{1}}$: \ldots{} :q$_{\text{|}\alpha\text{|}}$:q:qs)(w) = recog$_{\text{2}}$($\delta$$_{\text{G}}$(q)(s):q:qs)(w) \\ falls $\exists$ (s, $\alpha$, $\epsilon$ u) $\in$ q$_{\text{1}}$:s $\neq$ start, \\ w = $\epsilon$ = u $\lor$ head(w) = u $\in$ Z(G) $\lor$ \\ head(w) $\in$ u $\in$ BS
\item recog$_{\text{2}}$(q:qs)($\epsilon$) = 1 falls $\exists$ $\varphi$ : (start, $\varphi$, $\epsilon$, $\epsilon$) $\in$ q
\item recog$_{\text{2}}$(qs)(w) = 0 sonst
\end{itemize}

Offenbar gilt recog$_{\text{1}}$ = recog$_{\text{2}}$ \bigcirc h.

Zur optimieren verwenden wir eine Aktionstabelle 
\begin{itemize}
\item act$_{\text{G}}$: Q$_{\text{G}}$ \texttimes{} (BS $\cup$ 1) $\to$ R $\cup$ \{shift, error\}
\end{itemize}
F"ur alle u $\in$ BS $\cup$,

\begin{itemize}
\item act$_{\text{G}}$(q, u) = shift falls $\exists$ (s, $\alpha$, $\beta$, $\epsilon$) $\in$ q: $\beta$ $\neq$ $\epsilon$, u $\in$ first($\beta$), \\ s $\to$ $\alpha$ falls $\exists$ (s, $\alpha$, $\epsilon$ u) $\in$ q, \\ \emph{error} sonst
\end{itemize}

Dann erh"alt man eine Kompaktedefinition f"ur recog$_{\text{2}}$:

F"ur alle q, q$_{\text{i}}$ $\in$ Q$_{\text{G}}$, qs $\in$ Q$^{\text{*}}_{\text{G}}$, x $\in$ X und w $\in$ X$^{\text{*}}$,
\begin{itemize}
\item recog$_{\text{2}}$(q:qs)(xw) = recog$_{\text{2}}$($\delta$$_{\text{G}}$(q)(x):q:qs)(w) \\ falls x $\in$ Z(G), act$_{\text{G}}$(q, x) = shift
\item recog$_{\text{2}}$(q:qs)(xw) = recog$_{\text{2}}$($\delta$$_{\text{G}}$(q)(B):q:qs)(w) \\ falls $\exists$ B $\in$ BS : x $\in$ B, act$_{\text{G}}$(q, B) = shift
\item recog$_{\text{2}}$(q$_{\text{1}}$:\ldots{}:q$_{\text{|}\alpha\text{|}}$:q:qs)(w) = recog$_{\text{2}}$($\delta$$_{\text{G}}$(q)(s):q:qs)(w) \\ falls $\exists$ u $\in$ BS $\cup$ 1: act$_{\text{G}}$(q$_{\text{1}}$, u) = s $\to$ $\alpha$,\\ w = $\epsilon$ = u $\lor$ head(w) = u $\in$ Z(G) $\lor$ \\ head(w) $\in$ u $\in$ BS
\item recog$_{\text{2}}$(q:qs)($\epsilon$) = 1 falls act$_{\text{G}}$(q, $\epsilon$) = start $\to$ $\alpha$
\item recog$_{\text{2}}$(qs)(w) = 0 sonst
\end{itemize}

Beispiel f"ur SAB2 auf Seite 197 im Skript.
