Zusammenfassung.org
*** Formulierung der Korrektheit von compile_G
- F"ur alle w \in X^{*} und t \in T_{\Sigma(G), start}, \\ compile_G^A(q_0, \epsilon)(w) = \eta(fold^A(t)) \Rightarrow fold^{Word(G)}(t) = w, \\ compile_G^A(q_0, \epsilon)(w) = error(w) \Rightarrow w \notin L(G)_{start}
***  Beispiel SAB2; Seite 203

*** Beispiel yacc; Seite 204 

*** Sprachklassen-Hierarchie

- CFG \subset LR(k) \subset LL(k)
- LR(k) \subset LALR(k) \subset SLR(k) 
- LL(k)-Grammatiken sind _kurz gesagt_ diejenigen nicht-linksrekursiven CFGs, deren LL-Parser ohne Backtracking auskommen. 
- F"ur jeden Grammatiktyp T bedeutet die Formulierung *L ist eine T-Sprache* lediglich, dass eine T-Grammatik /existiert/ die L erzeugt 

**** Kommentar zu LL-Compiler

W"ahrend der LL-Compiler von Kapitel 6 - nach Beseitigung von Linksrekursion - jede kontexfreie Grammatik verarbeitet, selbst dann,
wenn sie mehrdeutig ist, zeigt die obige Grafikm dass die Forderung, dabei ohne Backtracking auszukommen, die Klasse der kompilierbaren 
Sprache erheblich einschr"ankt: Unter dieser Bedingung ist die bottom-up "Ubersetzung offenbar m"achtiger als die top-down Compilation.

Umgekehrt w"are es den Versuch wert (z.B. in Form einer BA), in Anlehnung an den obigen Compiler f"ur LR(1)-Grammatiken einen bottom-up
Compiler mit Backtracking zu entwickeln. Da die Determinismusforderung wegfiele, br"auchten wir keinen Lookahead beim Verarbeiten der 
Eingabe, womit die Zust"ande generell nur aus Tripeln best"unden - wie im beispiel Yacc.

* Haskell: Typen und Funktionen
Ich hoffe ihr seid fit in Haskell

* Haskell: Listen

* Haskell: Datentypen und Typklassen

* Algebren in Haskell

Sei \Sigma = (S, F) eine Signatur, obs(\Sigma) = {x_1,...,x_k}, S = {s_1,...,s_m} und F = {f_1: e_1 \to e'_1 .. f_n: e_n \to e'_n}.\\
Jede \Sigma-Algebra entspricht einem Element des folgenden polymorphen Datentyps:
#+BEGIN_SRC haskell
  data Sigma x1 ... xk s1 ... sm = Sigma {f1 :: e1 -> e1', ...,
                                          fn :: en -> en'}
#+END_SRC

Die Sorten und Operationen von \Sigma werden durch Typvariablen bzw. Destruktoren wiedergegeben und durch die Tr"agermengen bzw. 
kaskadierten Funktionen der jeweiligen Algebra instanziiert.

Um eine Signatur \Sigma in Haskell zu implementieren, gen"ugt es daher, den Datentyp ihrer Algebren nach obigem Schema zu formulieren.

Der Datentyp Sigma(x_1)...(x_k) repr"asentieren die Tr"agermengen einzelner Algebren.

** Beispiel f"ur Nat

#+BEGIN_SRC haskell 
  --natT implementiert T_Nat
  data Nat nat = Nat {zero :: nat, succ :: nat -> nat}

  natT :: Nat Int
  natT = Nat {zero = 0, succ = (+1)}

  --listT implementiert T_list(X)
  data List x list = List {nil :: list, cons :: x -> list -> list}

  listT :: List x [x]
  listT = List {nil = [], cons = (:)}

  --Beispiel foldList

  foldList :: List x list -> [x] -> list
  foldList alg [] = nil alg
  foldList alg (x:s) = cons alg x $ foldList alg s
#+END_SRC 

Weitere Beispiele ab Seite 252.

** Datentypen der JavaLight-Algebren

#+BEGIN_SRC haskell 
  data JavaLight commands command sum prod factor disjunct conjunct literal =
    JavaLight {seq_ :: command -> commands -> commands
              ,embed :: command -> commands
              ,block :: commands -> command
              ,assign :: String -> sum -> command
              ,cond :: disjunct -> command -> command -> command
              ,cond1, loop :: disjunct -> command -> command
              ,sum_ :: prod -> sum
              ,plus, minus :: sum -> prod -> sum
              ,prod :: factor -> prod
              ,times, div_ :: prod -> factor -> prod
              ,embedI :: Int -> factor
              ,var :: String -> factor
              ,encloseS :: sum -> factor
              ,disjunct :: conjunct -> disjunct -> disjunct
              ,embedC :: conjunct -> disjunct
              ,conjunct :: literal -> conjunct -> conjunct
              ,embedL :: literal -> conjunct
              ,not_ :: literal -> literal
              ,atom :: String -> sum -> sum -> literal
              ,embedB :: Bool -> literal
              ,encloseD :: disjunct -> literal}

  data SumProd sum sumsect prod prodsect factor =
    SumProd {sum' :: prod -> sumsect -> sum
            ,plus', minus' :: prod -> sumsect -> sumsect
            ,nilS :: sumsect
            ,prod' :: factor -> prodsect -> prod
            ,times', div' :: factor -> prodsect -> prodsect
            ,nilP :: prodsect}

  derec :: JavaLight s1 s2 sum prod factor s3 s4 s5 -> SumProd sum (sum -> sum) prod (prod -> prod) factor
  derec alg = SumProd {sum' = \a g -> g $ sum_ alg a,
                       plus' = \a g x -> g $ plus alg x a,
                       minus' = \a g x -> g $ minus alg x a,
                       nilS = id,
                       prod' = \a g -> g $ prod alg a,
                       times' = \a g x -> g $ times alg x a,
                       div' = \a g x -> g $ div_ alg x a,
                       nilP = id}
                        
                        
#+END_SRC


** Die Termalgebra von JavaLight 

#+BEGIN_SRC haskell 
  data Commands = Seq (Command, Commands) | Embed Command deriving Show

  data Command = Block Commands | Assign (String, Sum) |
                 Cond (Disjunct, Command, Command) | Cond1 (Disjunct, Command) |
                 Loop (Disjunct, Command) deriving Show

  data Sum = SUM Prod | PLUS (Sum, Prod) | MINUS (Sum, Prod) deriving Show

  data Prod = PROD Factor | TIMES (Prod, Factor) | DIV (Prod, Factor) deriving Show

  data Factor = EmbedI Int | Var String | EncloseS Sum deriving Show

  data Disjunct = Disjunct (Conjunct, Disjunct) | EmbedC Conjunct deriving Show

  data Conjunct = Conjunct (Literal, Conjunct) | EmbedL Literal deriving Show

  data Literal = Not Literal | Atom (String, Sum, Sum) | EmbedB Bool | EncloseD Disjunct deriving Show


  javaTerm :: JavaLight Commands Command Sum Prod Factor Disjunct Conjunct Literal
  javaTerm = JavaLight { seq_ = curry Seq, embed = Embed, block = Block
                       ,assign = curry Assign, cond = curry3 Cond, cond1 = curry Cond1
                       ,loop = curry Loop, sum_ = SUM, plus = curry PLUS
                       ,minus = curry MINUS, prod = PROD, times = curry TIMES
                       ,div_ = curry DIV, embedI = EmbedI, var = Var
                       ,encloseS = EncloseS, disjunct = curry Disjunct, embedC = EmbedC
                       ,conjunct = curry Conjunct, embedL = EmbedL, not_ = Not
                       ,atom = curry3 Atom, embedB = EmbedB, encloseD = EncloseD}

  javaWord :: JavaLight String String String String String String String
  javaWord = JavaLight {seq_ = (++)
                       ,embed = id
                       ,block = \cs -> " {" ++ cs ++ "}"
                       ,assign = \x e -> x ++ " = " ++ e ++ "; "
                       ,cond = \e c c' -> "if " ++ e ++ c ++ " else" ++ c'
                       ,cond1 = \e c -> "if " ++ e ++ c
                       ,loop = \e c -> "while " ++ e ++ c
                       ,sum_ = id
                       ,plus = \e e' -> e ++ '+':e'
                       ,minus = \e e' -> e ++ '-':e'
                       ,prod = id
                       ,times = \e e' -> e ++ '*':e'
                       ,div_ = \e e' -> e ++ '/':e'
                       ,embedI = show
                       ,var = id
                       ,encloseS = \e -> '(' : e ++ ")"
                       ,disjunct = \e e' -> e ++ " || " ++ e'
                       ,embedC = id
                       ,conjunct = \e e' -> e ++ " && " ++ e'
                       ,embedL = id
                       ,not_ = \be -> '!' : be
                       ,atom = \rel e e' -> e ++ rel ++ e'
                       ,embedB = show
                       ,encloseD = \e -> '(' : e ++ ")"}
             
#+END_SRC

