Zusammenfassung.tex

\subsubsection{Formulierung der Korrektheit von compile$_{\text{G}}$}
\label{sec-7-2-2}
\begin{itemize}
\item F"ur alle w $\in$ X$^{\text{*}}$ und t $\in$ T$_{\Sigma\text{(G), start}}$, \\ compile$_{\text{G}}^{\text{A}}$(q$_{\text{0}}$, $\epsilon$)(w) = $\eta$(fold$^{\text{A}}$(t)) $\Rightarrow$ fold$^{\text{Word(G)}}$(t) = w, \\ compile$_{\text{G}}^{\text{A}}$(q$_{\text{0}}$, $\epsilon$)(w) = error(w) $\Rightarrow$ w $\notin$ L(G)$_{\text{start}}$
\end{itemize}
\subsubsection{Beispiel SAB2; Seite 203}
\label{sec-7-2-3}

\subsubsection{Beispiel yacc; Seite 204}
\label{sec-7-2-4}

\subsubsection{Sprachklassen-Hierarchie}
\label{sec-7-2-5}

\begin{itemize}
\item CFG $\subset$ LR(k) $\subset$ LL(k)
\item LR(k) $\subset$ LALR(k) $\subset$ SLR(k)
\item LL(k)-Grammatiken sind \uline{kurz gesagt} diejenigen nicht-linksrekursiven CFGs, deren LL-Parser ohne Backtracking auskommen.
\item F"ur jeden Grammatiktyp T bedeutet die Formulierung \textbf{L ist eine T-Sprache} lediglich, dass eine T-Grammatik \emph{existiert} die L erzeugt
\end{itemize}

\begin{enumerate}
\item Kommentar zu LL-Compiler
\label{sec-7-2-5-1}

W"ahrend der LL-Compiler von Kapitel 6 - nach Beseitigung von Linksrekursion - jede kontexfreie Grammatik verarbeitet, selbst dann,
wenn sie mehrdeutig ist, zeigt die obige Grafikm dass die Forderung, dabei ohne Backtracking auszukommen, die Klasse der kompilierbaren 
Sprache erheblich einschr"ankt: Unter dieser Bedingung ist die bottom-up "Ubersetzung offenbar m"achtiger als die top-down Compilation.

Umgekehrt w"are es den Versuch wert (z.B. in Form einer BA), in Anlehnung an den obigen Compiler f"ur LR(1)-Grammatiken einen bottom-up
Compiler mit Backtracking zu entwickeln. Da die Determinismusforderung wegfiele, br"auchten wir keinen Lookahead beim Verarbeiten der 
Eingabe, womit die Zust"ande generell nur aus Tripeln best"unden - wie im beispiel Yacc.
\end{enumerate}

\section{Haskell: Typen und Funktionen}
\label{sec-8}
Ich hoffe ihr seid fit in Haskell

\section{Haskell: Listen}
\label{sec-9}

\section{Haskell: Datentypen und Typklassen}
\label{sec-10}

\section{Algebren in Haskell}
\label{sec-11}

Sei $\Sigma$ = (S, F) eine Signatur, obs($\Sigma$) = \{x$_{\text{1}}$,\ldots{},x$_{\text{k}}$\}, S = \{s$_{\text{1}}$,\ldots{},s$_{\text{m}}$\} und F = \{f$_{\text{1}}$: e$_{\text{1}}$ $\to$ e'$_{\text{1}}$ .. f$_{\text{n}}$: e$_{\text{n}}$ $\to$ e'$_{\text{n}}$\}.\\
Jede $\Sigma$-Algebra entspricht einem Element des folgenden polymorphen Datentyps:
\begin{verbatim}
data Sigma x1 ... xk s1 ... sm = Sigma {f1 :: e1 -> e1', ...,
					fn :: en -> en'}
\end{verbatim}

Die Sorten und Operationen von $\Sigma$ werden durch Typvariablen bzw. Destruktoren wiedergegeben und durch die Tr"agermengen bzw. 
kaskadierten Funktionen der jeweiligen Algebra instanziiert.

Um eine Signatur $\Sigma$ in Haskell zu implementieren, gen"ugt es daher, den Datentyp ihrer Algebren nach obigem Schema zu formulieren.

Der Datentyp Sigma(x$_{\text{1}}$)\ldots{}(x$_{\text{k}}$) repr"asentieren die Tr"agermengen einzelner Algebren.

\subsection{Beispiel f"ur Nat}
\label{sec-11-1}

\begin{verbatim}
--natT implementiert T_Nat
data Nat nat = Nat {zero :: nat, succ :: nat -> nat}

natT :: Nat Int
natT = Nat {zero = 0, succ = (+1)}

--listT implementiert T_list(X)
data List x list = List {nil :: list, cons :: x -> list -> list}

listT :: List x [x]
listT = List {nil = [], cons = (:)}

--Beispiel foldList

foldList :: List x list -> [x] -> list
foldList alg [] = nil alg
foldList alg (x:s) = cons alg x $ foldList alg s
\end{verbatim}

Weitere Beispiele ab Seite 252.

\subsection{Datentypen der JavaLight-Algebren}
\label{sec-11-2}

\begin{verbatim}
data JavaLight commands command sum prod factor disjunct conjunct literal =
  JavaLight {seq_ :: command -> commands -> commands
	    ,embed :: command -> commands
	    ,block :: commands -> command
	    ,assign :: String -> sum -> command
	    ,cond :: disjunct -> command -> command -> command
	    ,cond1, loop :: disjunct -> command -> command
	    ,sum_ :: prod -> sum
	    ,plus, minus :: sum -> prod -> sum
	    ,prod :: factor -> prod
	    ,times, div_ :: prod -> factor -> prod
	    ,embedI :: Int -> factor
	    ,var :: String -> factor
	    ,encloseS :: sum -> factor
	    ,disjunct :: conjunct -> disjunct -> disjunct
	    ,embedC :: conjunct -> disjunct
	    ,conjunct :: literal -> conjunct -> conjunct
	    ,embedL :: literal -> conjunct
	    ,not_ :: literal -> literal
	    ,atom :: String -> sum -> sum -> literal
	    ,embedB :: Bool -> literal
	    ,encloseD :: disjunct -> literal}

data SumProd sum sumsect prod prodsect factor =
  SumProd {sum' :: prod -> sumsect -> sum
	  ,plus', minus' :: prod -> sumsect -> sumsect
	  ,nilS :: sumsect
	  ,prod' :: factor -> prodsect -> prod
	  ,times', div' :: factor -> prodsect -> prodsect
	  ,nilP :: prodsect}

derec :: JavaLight s1 s2 sum prod factor s3 s4 s5 -> SumProd sum (sum -> sum) prod (prod -> prod) factor
derec alg = SumProd {sum' = \a g -> g $ sum_ alg a,
		     plus' = \a g x -> g $ plus alg x a,
		     minus' = \a g x -> g $ minus alg x a,
		     nilS = id,
		     prod' = \a g -> g $ prod alg a,
		     times' = \a g x -> g $ times alg x a,
		     div' = \a g x -> g $ div_ alg x a,
		     nilP = id}
\end{verbatim}


\subsection{Die Termalgebra von JavaLight}
\label{sec-11-3}

\begin{verbatim}
data Commands = Seq (Command, Commands) | Embed Command deriving Show

data Command = Block Commands | Assign (String, Sum) |
	       Cond (Disjunct, Command, Command) | Cond1 (Disjunct, Command) |
	       Loop (Disjunct, Command) deriving Show

data Sum = SUM Prod | PLUS (Sum, Prod) | MINUS (Sum, Prod) deriving Show

data Prod = PROD Factor | TIMES (Prod, Factor) | DIV (Prod, Factor) deriving Show

data Factor = EmbedI Int | Var String | EncloseS Sum deriving Show

data Disjunct = Disjunct (Conjunct, Disjunct) | EmbedC Conjunct deriving Show

data Conjunct = Conjunct (Literal, Conjunct) | EmbedL Literal deriving Show

data Literal = Not Literal | Atom (String, Sum, Sum) | EmbedB Bool | EncloseD Disjunct deriving Show


javaTerm :: JavaLight Commands Command Sum Prod Factor Disjunct Conjunct Literal
javaTerm = JavaLight { seq_ = curry Seq, embed = Embed, block = Block
		     ,assign = curry Assign, cond = curry3 Cond, cond1 = curry Cond1
		     ,loop = curry Loop, sum_ = SUM, plus = curry PLUS
		     ,minus = curry MINUS, prod = PROD, times = curry TIMES
		     ,div_ = curry DIV, embedI = EmbedI, var = Var
		     ,encloseS = EncloseS, disjunct = curry Disjunct, embedC = EmbedC
		     ,conjunct = curry Conjunct, embedL = EmbedL, not_ = Not
		     ,atom = curry3 Atom, embedB = EmbedB, encloseD = EncloseD}

javaWord :: JavaLight String String String String String String String
javaWord = JavaLight {seq_ = (++)
		     ,embed = id
		     ,block = \cs -> " {" ++ cs ++ "}"
		     ,assign = \x e -> x ++ " = " ++ e ++ "; "
		     ,cond = \e c c' -> "if " ++ e ++ c ++ " else" ++ c'
		     ,cond1 = \e c -> "if " ++ e ++ c
		     ,loop = \e c -> "while " ++ e ++ c
		     ,sum_ = id
		     ,plus = \e e' -> e ++ '+':e'
		     ,minus = \e e' -> e ++ '-':e'
		     ,prod = id
		     ,times = \e e' -> e ++ '*':e'
		     ,div_ = \e e' -> e ++ '/':e'
		     ,embedI = show
		     ,var = id
		     ,encloseS = \e -> '(' : e ++ ")"
		     ,disjunct = \e e' -> e ++ " || " ++ e'
		     ,embedC = id
		     ,conjunct = \e e' -> e ++ " && " ++ e'
		     ,embedL = id
		     ,not_ = \be -> '!' : be
		     ,atom = \rel e e' -> e ++ rel ++ e'
		     ,embedB = show
		     ,encloseD = \e -> '(' : e ++ ")"}
\end{verbatim}
