Zusammenfassung.tex

\subsection{Zustandsmodell von JavaLight}
\label{sec-11-4}

\begin{verbatim}
type St a = Store -> a

rel :: String -> Int -> Int -> Bool
rel = \case "<" -> (<)
	    ">" -> (>)
	    "<=" -> (<=)
	    ">=" -> (>=)
	    "==" -> (==)
	    "!=" -> (/=)

javaState :: JavaLight (St Store) (St Store) (St Int) (St Int) (St Int) (St Bool) (St Bool) (St Bool)
javaState = JavaLight {seq_ = flip (.)
		      ,embed = id
		      ,block = id
		      ,assign = \x e st -> update st x $ e st
		      ,cond = cond
		      ,cond1 = \p f -> cond p f id
		      ,loop = loop
		      ,sum_ = id
		      ,plus = liftM2 (+)
		      ,minus = liftM2 (-)
		      ,prod = id
		      ,times = liftM2 (*)
		      ,div_ = liftM2 div
		      ,embedI = const
		      ,var = flip ($)
		      ,encloseS = id
		      ,disjunct = liftM2 (||)
		      ,embedC = id
		      ,conjunct = liftM2 (&&)
		      ,embedL = id
		      ,not_ = (not .)
		      ,atom = liftM2 . rel
		      ,embedB = const
		      ,encloseD = id}
	    where
	      cond :: St Bool -> St Store -> St Store -> St Store
	      cond p f g st = if p st then f st else g st
	      loop :: St Bool -> St Store -> St Store
	      loop p f st = if p st then loop f $ f st else st
\end{verbatim}

\subsubsection{Interpretation eines JavaLight Programms}
\label{sec-11-4-1}

prog = fact = 1; while x > 1 \{fact = fact*x; x = x-1;\}

compile$^{\text{A}}_{\text{JavaLight}}$(prog) : Store $\to$ Store \\
compile$^{\text{A}}_{\text{JavaLight}}$ = $\lambda$(store). $\lambda$(z). if z = x then 0 else if z = fact then store(x)! else store(z)

\subsection{Ableitungsbaumalgebra von JavaLight}
\label{sec-11-5}

\begin{verbatim}
type TS = Tree String

javaDeri :: JavaLight TS TS TS TS TS TS TS
javaDeri = JavaLight {seq_ = \c c' -> F "Commands" [c,c']
		     ,embed = \c -> F "Commands" [c]
		     ,assign = \x e -> command [leaf x, leaf "=", e, leaf ";"]
		     ,cond = \e c c' -> command [leaf "if", e, c, leaf "else", c']
		     ,cond1 = \e c -> command [leaf "if", e, c]
		     ,loop = \e c -> command [leaf "while", e, c]
		     ,sum_ = \e -> F "Sum" [e]
		     ,plus = \e e' -> F "Sum" [e, e']
		     ,minus = \e e' -> F "Sum" [e, e']
		     ,prod = \e -> F "Prod" [e]
		     ,times = \e e' -> F "Prod" [e, e']
		     ,div_ = \e e' -> F "Prod" [e, e']
		     ,embedI = \i -> factor [leaf $ show i]
		     ,var = \x -> factor [leaf x]
		     ,encloseS = \e -> factor [leaf "(", e, leaf ")"]
		     ,disjunct = \e e -> F "Disjunct" [e, leaf, "||", e']
		     ,embedC = \e -> F "Disjunct" [e]
		     ,conjunct = \e e' -> F "Conjunct" [e, leaf "&&", e']
		     ,embedL = \e -> F "Conjunct" [e]
		     ,not_ = \be -> literal [leaf "!", be]
		     ,atom = \rel e e' -> literal [e, leaf rel, e']
		     ,embedB = \b -> literal [leaf $ show b]
		     ,encloseD = \e -> literal [leaf "(", e, leaf ")"]}
	   where
	     command = F "Command"
	     factor = F "Factor"
	     literal = F "Literal"
	     leaf = flip F []
\end{verbatim}

\subsection{Beispiel XMLstore-Algebren (Seite 265)}
\label{sec-11-6}

\section{Attributierte "Ubersetzung}
\label{sec-12}
\subsection{Bin"ardarstellung rationaler Zahlen}
\label{sec-12-1}
\subsection{Strings mit Hoch- und Tiefdarstellung}
\label{sec-12-2}
\subsection{"ubersetzung regul"arer Ausdr"uck in erkennenden Automaten}
\label{sec-12-3}
\subsection{Darstellung von Termen als hierarchische Listen}
\label{sec-12-4}
\subsection{Eine kellerbasierte Zielsprache f"ur JavaLight}
\label{sec-12-5}
Der folgende Datentyp liefert die Befehle einer Assemblersprache, die auf einem Keller vom Typ Z und einem Speicher vom Typ
\begin{center}
Store = String $\to$ Z
\end{center}
operiert. Hierbei betrachten wir die Abstraktion eines realen Speichers.

\begin{verbatim}
data StackCom = Push Int | Pop | Load String | Save String | Add |
		Sub | Mul | Div | Or_ | And_ | Inv | Cmp String | Jump Int |
		JumpF Int

type State = ([Int], Store, Int)

executeCom :: StackCom -> State -> State
executeCom com (stack, store, n) =
  case com of Push a -> (a:stack, store, n+1)
	      Pop    -> (tail stack, store, n+1)
	      Load x -> (store x:stack, store, n+1)
	      Save x -> (stack, update store x $ head stack, n+1)
	      Add    -> (a+b:s, store, n+1) where a:b:s = stack
	      Sub    -> (b-a:s, store, n+1) where a:b:s = stack
	      Mul    -> (a*b:s, store, n+1) where a:b:s = stack
	      Div    -> (a`div`b:s, store, n+1) where a:b:s = stack
	      Or_    -> (max a b:s, store, n+1) where a:b:s = stack
	      And_   -> (a*b:s, store, n+1)     where a:b:s = stack
	      Inv    -> ((a+1) `mod`2:s, store, n+1) where a:s = stack
	      Cmp str -> (c:s, store, n+1)
		where a:b:s = stack
		      c = if rel str a b then 1 else 0
	      Jump k  -> (stack, store, k)
	      JumpF k -> (stack, store, if a == 0 then k else n+1) where a:_ = stack

execute :: [StackCom] -> State -> State
execute cs state@(_,_,n) = if n >= length cs then State
			   else execute cs $ executeCom (cs !! n) state
\end{verbatim}

Die Tr"agermengen haben neben dem jeweiligen Zielcode code ein (vererbtes) Attribut, das die Nummer des erten Befehls von code
wiedergibt. Dementsprechend interpretiert javaStack alle Sorten von JavaLight durch den Funktionstyp

\begin{verbatim}
type LCom = Int -> [StackCom]

javaStack :: JavaLight LCom LCom LCom LCom LCom LCom LCom
javaStack = JavaLight {seq_ = seq_
		      ,embed = id
		      ,block = id
		      ,assign = \x e lab -> e lab ++ [Save x, Pop]
		      ,cond = \e c c' lab -> let (code, exit) = fork e c 1 lab
						 code' = e' exit
					     in code ++ Jump (exit + length code') : code'
		      ,cond1 = \e c -> fst . fork e c 0
		      ,loop = \e c lab -> fst (fork e c 1 lab) ++ [Jump lab]
		      ,sum_ = id
		      ,plus = apply2 Add
		      ,minus = apply2 Sub
		      ,prod = id
		      ,times = apply2 Mul
		      ,div_ = apply2 Div
		      ,embedI = \i -> const [Push i]
		      ,var = \x -> const [Load x]
		      ,encloseS = id
		      ,disjunct = apply2 Or_
		      ,embedC = id
		      ,conjunct = apply2 And_
		      ,embedL = id
		      ,not_ = apply1 Inv
		      ,atom = apply2 . Cmp
		      ,embedB = \b -> const [Push $ if b then 1 else 0]
		      ,encloseD = id}
	    where apply1 :: StackCom -> LCom -> LCom
		  apply1 op e lab = e lab ++ [op]
		  seq_ :: LCom -> LCom -> LCom
		  seq_ e e' lab = code ++ e' (lab + length code)
		    where code = e lab
		  apply2 :: StackCom -> LCom -> LCom -> LCom
		  apply2 op e e' lab = code ++ e' (lab + length code) ++ [op]
		    where code = e lab
		  fork :: LCom -> LCom -> Int -> Int -> ([StackCom], Int)
		  fork e c n lab = (code ++ JumpF exit : code', exit)
		    where code = e lab
			  lab' = lab + length code + 1
			  code' = c lab'
			  exit = lab' + length code' + n
\end{verbatim}

\section{JavaLight+ = JavaLight + I/O + Deklaration + Prozedure}
\label{sec-13}
Ich meine, er h"atte gesagt, dass sei f"ur die Pr"ufung nicht mehr relevant, deshalb habe ich viele Details weg gelassen.
