Zusammenfassung.org
** Assemblersprache mit I/O und Kelleradressierung

Die Variablenbelegung store: String \to Z mit Zustandsmodell von Abschnitt Assemblerprogramm als JavaLight-Zielalgebra wird ersetzt 
durch den Keller stack \in Z^{*}, der jetzt nicht nur der schrittweisen Auswertung von Ausdr"ucken dient, sondern auch der Ablage von 
Variablenwerten unter vom Compiler berechneten Adressen. Witerer Zustandskomponenten sind:

- der Inhalt des Registers *BA* f"ur die jeweils aktuelle Basisadresse
- der Inhalt des Registers *STP* f"ur die Basisadresse des statischen Vorg"angers des jeweils zu "uberstzenden Blocks bzw. Funktionsaufruf
- der schon Abschnitt 12.5 benutze *Befehlsz"ahler* pc (program counter)
- der Ein/Ausgabestrom io, auf den Lese- bzw Schreibbefehler zugreifen

Der entsprechende Datentyp lautet daher wie folgt

#+BEGIN_SRC haskell 
  data State = State {stack, io :: [Int], ba, stp, pc :: Int}

  baseAdr :: Int -> Int -> SymAdr
  baseAdr declDep dep = if declDep == dep then BA else Dex BA declDep

  -- Die folgenden Funktionen berechnen aus symbolischen Adressen
  -- absolute Adressen bzw. Kellerinhalte:

  absAdr, contents :: State -> SymAdr -> Int
  absAdr _ (Con i) = i
  absAdr state BA = ba state
  absAdr state STP = stp State
  absAdr state TOP = length $ stack state
  absAdr state (Dex BA i) = ba state+i
  absAdr state (Dex STP i) = stp state + i
  absAdr state (Dex adr i) = contents state adr + i

  contents state (Dex adr i) = s !! (k-i)
                               where (s,k) = stackPos state adr
  contents state adr = absAdr state adr

  stackPos :: State -> SymAdr -> ([Int], Int)
  stackPos state adr = (s, length s-1-contents state adr)
                       where s = stack State

  updState :: State -> SymAdr -> Int -> State
  updState state BA x = state {ba = x}
  updState state STP x = state {stp = x}
  updState state (Dex adr i) x = state {stack = updList s (k-i) x}
    where (s, k) = stackPos state adr
#+END_SRC


Die Algebra funktioniert "ahnlich wie die vorige (f"ur eine Definition, Folien Skript 193)

** Grammatik und abstrakte Syntax von JavaLight+

JavaLight+ enth"ahlt neben den Sorten von JavaLight die Sorten Formals und Actuals f"ur Listen formaler bzw. aktueller Parameter von 
Prozeduren. Auch die BS von JavaLigth werden "ubernommen. Hinzu kommt eine f"ur formale Paramter. Sie besteht aus mit zwei 
Konstruktoren aus dem jeweiligen Parameternamen und einem Typdeskriptor gebildeten Ausdruck:

#+BEGIN_SRC haskell
  data TypeDesc = INT | BOOL | UNIT | Fun TypeDesc INT | ForFun TypeDesc
  data Formal = Par String TypeDesc | FunPar String [Formal] TypeDesc
#+END_SRC
- FunPar (x)(t) : Prozedurvariable
- ForFun(t) : Typ einer Prozedurvariable, t ist hier der Typ der Prozedurergebnisse 
- Fun(t,lab): Prozedurkonstante, t Ergebnistyp, Codeadresse lab.

Die Grammatik findet sich auf Seite 294 im Skript. \\
Abstrakte Syntax Seite 295. \\
** javaStackP-Alpgebra, Seite 297

javaStackP umschlie"st im Gegensatz zu javaStack bei der Zusammenfassung einer Kommandofolge cs zu einem Block den code von cs mit 
zus"atzlichen Zielcode. (Beispiel S. 302)

** Weitere Lekt"ure
- Kapitel 5, wird auch die "Ubersetzung von Feldern und Records behandelt. (?)
- Grundlagen der Kompilation funktionaler Sprachen findet man in Kapitel 7
- Die "Ubersetzung oo Sprachen sind Thema von [46], Kapitel 5

** Beispiel Programm (S. 314)

* Mehrp"assige Compiler (S. 319)
Wird nicht besprochen in der Veranstaltung

* Funktoren und Monaden in Haskell
Sind aus FuPro /hoffentlich/ bekannt.

* Induktion, Coinduktion und rekursive Gleihcungen (S. 354)
Sollte auch bekannt sein.

* Iterative Gleichungen (S. 370)

* Interpretation in stetigen Algebren (S. 387)

* Literatur (S. 420)
