Zusammenfassung.tex
\subsection{Assemblersprache mit I/O und Kelleradressierung}
\label{sec-13-1}

Die Variablenbelegung store: String $\to$ Z mit Zustandsmodell von Abschnitt Assemblerprogramm als JavaLight-Zielalgebra wird ersetzt 
durch den Keller stack $\in$ Z$^{\text{*}}$, der jetzt nicht nur der schrittweisen Auswertung von Ausdr"ucken dient, sondern auch der Ablage von 
Variablenwerten unter vom Compiler berechneten Adressen. Witerer Zustandskomponenten sind:

\begin{itemize}
\item der Inhalt des Registers \textbf{BA} f"ur die jeweils aktuelle Basisadresse
\item der Inhalt des Registers \textbf{STP} f"ur die Basisadresse des statischen Vorg"angers des jeweils zu "uberstzenden Blocks bzw. Funktionsaufruf
\item der schon Abschnitt 12.5 benutze \textbf{Befehlsz"ahler} pc (program counter)
\item der Ein/Ausgabestrom io, auf den Lese- bzw Schreibbefehler zugreifen
\end{itemize}

Der entsprechende Datentyp lautet daher wie folgt

\begin{verbatim}
data State = State {stack, io :: [Int], ba, stp, pc :: Int}

baseAdr :: Int -> Int -> SymAdr
baseAdr declDep dep = if declDep == dep then BA else Dex BA declDep

-- Die folgenden Funktionen berechnen aus symbolischen Adressen
-- absolute Adressen bzw. Kellerinhalte:

absAdr, contents :: State -> SymAdr -> Int
absAdr _ (Con i) = i
absAdr state BA = ba state
absAdr state STP = stp State
absAdr state TOP = length $ stack state
absAdr state (Dex BA i) = ba state+i
absAdr state (Dex STP i) = stp state + i
absAdr state (Dex adr i) = contents state adr + i

contents state (Dex adr i) = s !! (k-i)
			     where (s,k) = stackPos state adr
contents state adr = absAdr state adr

stackPos :: State -> SymAdr -> ([Int], Int)
stackPos state adr = (s, length s-1-contents state adr)
		     where s = stack State

updState :: State -> SymAdr -> Int -> State
updState state BA x = state {ba = x}
updState state STP x = state {stp = x}
updState state (Dex adr i) x = state {stack = updList s (k-i) x}
  where (s, k) = stackPos state adr
\end{verbatim}


Die Algebra funktioniert "ahnlich wie die vorige (f"ur eine Definition, Folien Skript 193)

\subsection{Grammatik und abstrakte Syntax von JavaLight+}
\label{sec-13-2}

JavaLight+ enth"ahlt neben den Sorten von JavaLight die Sorten Formals und Actuals f"ur Listen formaler bzw. aktueller Parameter von 
Prozeduren. Auch die BS von JavaLigth werden "ubernommen. Hinzu kommt eine f"ur formale Paramter. Sie besteht aus mit zwei 
Konstruktoren aus dem jeweiligen Parameternamen und einem Typdeskriptor gebildeten Ausdruck:

\begin{verbatim}
data TypeDesc = INT | BOOL | UNIT | Fun TypeDesc INT | ForFun TypeDesc
data Formal = Par String TypeDesc | FunPar String [Formal] TypeDesc
\end{verbatim}
\begin{itemize}
\item FunPar (x)(t) : Prozedurvariable
\item ForFun(t) : Typ einer Prozedurvariable, t ist hier der Typ der Prozedurergebnisse
\item Fun(t,lab): Prozedurkonstante, t Ergebnistyp, Codeadresse lab.
\end{itemize}

Die Grammatik findet sich auf Seite 294 im Skript. \\
Abstrakte Syntax Seite 295. \\
\subsection{javaStackP-Alpgebra, Seite 297}
\label{sec-13-3}

javaStackP umschlie"st im Gegensatz zu javaStack bei der Zusammenfassung einer Kommandofolge cs zu einem Block den code von cs mit 
zus"atzlichen Zielcode. (Beispiel S. 302)

\subsection{Weitere Lekt"ure}
\label{sec-13-4}
\begin{itemize}
\item Kapitel 5, wird auch die "Ubersetzung von Feldern und Records behandelt. (?)
\item Grundlagen der Kompilation funktionaler Sprachen findet man in Kapitel 7
\item Die "Ubersetzung oo Sprachen sind Thema von \footnote{DEFINITION NOT FOUND.}, Kapitel 5
\end{itemize}

\subsection{Beispiel Programm (S. 314)}
\label{sec-13-5}

\section{Mehrp"assige Compiler (S. 319)}
\label{sec-14}
Wird nicht besprochen in der Veranstaltung

\section{Funktoren und Monaden in Haskell}
\label{sec-15}
Sind aus FuPro \emph{hoffentlich} bekannt.

\section{Induktion, Coinduktion und rekursive Gleihcungen (S. 354)}
\label{sec-16}
Sollte auch bekannt sein.

\section{Iterative Gleichungen (S. 370)}
\label{sec-17}

\section{Interpretation in stetigen Algebren (S. 387)}
\label{sec-18}

\section{Literatur (S. 420)}
\label{sec-19}
% Emacs 25.2.1 (Org mode 8.2.10)
\end{document}
